package com.thekhachik.goenglish;

public class TutorialsData {

    static String nouns =  "Виды существительных по образованию\n\n" +
            "Имена существительные английского языка по своему строению и образованию делятся на простые, производные и составные существительные. Также все существительные делятся на имена нарицательные и имена собственные.\n" +
            "\n" +
            "Простые существительные (Simple Nouns) состоят из одного корня и не имеют суффиксов или префиксов. Часто это односложные слова (состоящие из одного слога).\n" +
            "\n" +
            "\tman – мужчина, человек\n" +
            "\thouse – дом\n" +
            "\tstar – звезда\n" +
            "\tlove – любовь\n\n" +
            "Производные существительные (Derivative Nouns) состоят из корня с добавлением суффиксов или префиксов.\n" +
            "\n" +
            "\tbrotherhood – братство\n" +
            "\tengineer – инженер\n" +
            "\tactress – актриса\n" +
            "\timmortality – бессмертие\n\n" +
            "Составные существительные (Compound Nouns) образуются из двух и более слов или корней слов. Они могут образовываться с помощью комбинации не только одних существительных, но и других частей речи (прилагательных, глаголов, предлогов).\n" +
            "\n\n" +
            "существ. + существ.\n\n" +
            "\tfireman – пожарный\n" +
            "\tfire – огонь\n" +
            "\tman – мужчина\n\n\n" +
            "существ. + глагол\n\n" +
            "\twaterfall – водопад\n" +
            "\twater – вода\n" +
            "\tfall – падать\n\n\n" +
            "Имена нарицательные\n\n" +
            "Нарицательные имена (Common Names) указывают на общие названия предметов, материй, лиц и понятий, их категорий и групп.\n" +
            "\n" +
            "\thuman – человек\n" +
            "\tfeeling – чувство, ощущение\n" +
            "\tanimal – животное\n" +
            "\tlove – любовь\n" +
            "\tfather – отец\n" +
            "\tbus – автобус\n\n\n" +
            "Имена собственные\n\n" +
            "Имена собственные (Proper Names) – это существительные, которые указывают на уникальные, единичные предметы, лица, понятия. Имена собственные всегда пишутся с большой буквы. Могут использоваться с определенным артиклем the или без него.\n" +
            "\n" +
            "К ним относятся: личные имена, географические названия, национальности и языки, названия улиц, площадей, организаций и предприятий, журналов, названия небесных тел, названия дней недели и месяцев, названия праздников.\n" +
            "\n\n" +
            "Личные имена, псевдонимы, прозвища людей, клички животных.\n" +
            "\n" +
            "\tPeter Johnson – Питер Джонсон (имя)\n" +
            "\tDwayne The Rock – Дуэйн Скала (имя и псевдоним)\n" +
            "\tIron Arny – Железный Арни (псевдоним)\n" +
            "\tButch – Буч (кличка собаки)\n" +
            "\tScarlett the cat – кошка Скарлетт (кличка кошки)\n" +
            "\tBoo the rat – крыса Бу (кличка крысы)\n\n\n" +
            "Географические названия (горы, пустыни, реки, океаны, страны, города и другие).\n" +
            "\n" +
            "\tMount Fuji – гора Фудзи\n" +
            "\tAsia – Азия\n" +
            "\tEngland – Англия\n" +
            "\tNew York – Нью-Йорк\n" +
            "\tthe Great Lakes – Великие озера\n" +
            "\tthe Pacific Ocean – Тихий океан\n" +
            "\tthe Black Sea – Черное море\n" +
            "\tthe Amazon River – р. Амазонка\n\n\n" +
            "Национальности и языки.\n" +
            "\n" +
            "\tEnglish – английский язык\n" +
            "\tSpanish – испанец\n" +
            "\tthe French – французы\n\n\n" +
            "Названия улиц, площадей, парков, мостов, зданий, отелей, музеев, кораблей.\n" +
            "\n" +
            "\tFifth Avenue – Пятая авеню\n" +
            "\tTimes Square – Таймс-сквер\n" +
            "\tCentral Park – Центральный парк\n" +
            "\tLondon Bridge – Лондонский мост\n" +
            "\tThe Louvre Museum – музей Лувр\n" +
            "\tThe Grand Budapest Hotel – отель Гранд Будапешт\n" +
            "\tThe Cruiser Aurora – крейсер Аврора\n\n\n" +
            "Названия организаций, учреждений, фирм, компаний, газет, журналов.\n" +
            "\n" +
            "\tWorld Wildlife Fund – Всемирный фонд дикой природы\n" +
            "\tUnited Nations – Организация Объединенный Наций\n" +
            "\tMcDonald's – Макдональдс\n" +
            "\tThe New York Times Magazine – журнал “Нью-Йорк Таймс”\n" +
            "\tThe Washington Post – газета “Вашингтон пост”\n\n\n" +
            "Названия небесных тел.\n" +
            "\n" +
            "\tthe Sun – Солнце (звезда)\n" +
            "\tthe Earth – Земля (планета)\n" +
            "\tMars – Марс\n" +
            "\tAlpha Centauri – Альфа Центавра\n\n\n" +
            "Названия дней недели, месяцев.\n" +
            "\n" +
            "\tMonday – понедельник\n" +
            "\tSunday – воскресенье\n" +
            "\tAugust – август\n" +
            "\tJanuary – январь\n\n\n" +
            "Названия праздников, значимых событий.\n" +
            "\n" +
            "\tChristmas – Рождество\n" +
            "\tNew Year – Новый Год\n" +
            "\tBirthday – День рождения\n" +
            "\tMother’s Day – День матери\n" +
            "\tIndependence Day – День независимости\n\n\n" +
            "Исчисляемые существительные\n\n" +
            "Исчисляемые существительные (Countable Nouns) указывают на одушевленные и неодушевленные объекты, а также понятия, которые можно посчитать. Данные существительные имеют форму множественного числа, которая в большинстве случаев образуется с помощью добавления окончания -s, если у этого существительного нет формы неправильного множественного числа (Irregular plural nouns).\n" +
            "\n" +
            "\ta dog – собака\n" +
            "\ta pupil – ученик\n" +
            "\ta man – мужчина\n" +
            "\ta mouse – мышь\n" +
            "\ttwo dogs – две собаки\n" +
            "\tten pupils – десять учеников\n" +
            "\tsix men – шесть мужчин\n" +
            "\tmany mice – много мышей\n\n\n" +
            "Исчисляемые существительные разделяются на конкретные (concrete) - реальные предметы, живые существа, и абстрактные (abstract) - абстракции, понятия, чувства.\n" +
            "\n" +
            "\ta building – здание\n" +
            "\ta girl – девочка\n" +
            "\ta pen – ручка\n\n\n" +
            "Абстрактное понятие\n\n" +
            "\ta problem – проблема (абстр.)\n" +
            "\ta feeling – чувство\n" +
            "\tan invitation – приглашение\n\n\n" +
            "Неисчисляемые существительные\n\n" +
            "Неисчисляемые существительные (Uncountable Nouns) не поддаются счету и не имеют формы множественного числа. Они разделяются на абстрактные (abstract nouns) неисчисляемые понятия и вещественные (material nouns): названия материалов, жидкостей, веществ.\n" +
            "\n\n" +
            "Абстрактные существ.\n\n" +
            "\tmusic – музыка\n" +
            "\tlove – любовь\n" +
            "\tinformation – информация\n" +
            "\tвещественные существ.\n" +
            "\twater – вода\n" +
            "\tcotton – хлопок, вата\n" +
            "\tiron – железо\n\n" +
            "Иногда неисчисляемые существительные в зависимости от их значения могут принимать форму множественного числа. Во множественном числе они указывают на различные виды предмета, или количество емкостей для них.\n" +
            "\n" +
            "\tCoffee makes me alive every morning. – Кофе оживляет меня каждое утро (кофе как жидкость)\n" +
            "\tTwo coffees, please! – Два кофе, пожалуйста! (2 чашки кофе)\n" +
            "\tIron is a type of metal. – Железо - это тип металла.\n" +
            "\tAll my irons are broken. I have to buy a new one. – Все мои утюги сломаны. Мне нужно купить новый.\n\n\n" +
            "Собирательные существительные\n\n" +
            "Собирательные существительные (Collective Nouns) указывают на группы, собрания одушевленных и неодушевленных объектов. Часто собирательные существительные указывают именно на группы людей и животных.\n" +
            "\n" +
            "\tfamily – семья\n" +
            "\tclass – класс\n" +
            "\tcrowd – толпа\n" +
            "\tset – набор\n\n" +
            "В зависимости от контекста собирательные существительные в предложениях могут использоваться как существительные в единственном, так и в множественном числе.\n" +
            "\n" +
            "Единственное число указывает на то, что группа предметов или лиц действует как одно целое. Множественное число указывает на то, что члены, участники определенной группы, собрания действуют отдельно друг от друга.\n" +
            "\n" +
            "\tEvery week this class has a math test. – Каждую неделю этот класс пишет тест по математике (все ученики класса вместе)\n" +
            "\tAfter every test the class start to chat with each other or do their hometasks. – После каждого теста в классе начинают разговаривать друг с другом или делать домашнюю работу. (ученики класса действуют отдельно)\n" +
            "\tThe committee adopts this decision with a solid vote. – Комитет единогласно принимает это решение.\n" +
            "\tIt is hard to adopt any decision because the committee constantly argue about something. – Сложно принимать любое решение, так как члены комитета непрерывно о чем-то спорят.\n" +
            "\n\n\nРод существительных\n\n" +
            "Род существительных указывает на принадлежность существительного к мужскому или женскому полу. В английском языке не всегда можно определить род по окончанию слова, как в русском. К тому же только существительные, указывающие на одушевленные объекты, людей могут различаться по родам (мужскому и женскому). Все остальные существительные относятся к нейтральному роду (it).\n" +
            "\n\n" +
            "He, She\n\n" +
            "Среди одушевленных объектов выделяют мужской род (masculine gender), женский род (feminine gender) и общий род (common gender).\n" +
            "\n" +
            "Мужской род\n\n" +
            "\the – он\n" +
            "\ta man – мужчина\n" +
            "\ta boy – мальчик\n" +
            "\ta groom – жених\n" +
            "\ta husband – муж\n" +
            "\tan uncle – дядя\n" +
            "\ta gentleman – джентльмен\n\n\n" +
            "Женский род\n\n" +
            "\tshe – она\n" +
            "\ta woman – женщина\n" +
            "\ta girl – девочка\n" +
            "\ta bride – невеста\n" +
            "\ta wife – жена\n" +
            "\tan aunt – тетя\n" +
            "\ta lady – леди\n\n" +
            "К мужскому роду также причисляют неодушевленные существительные, которые в культуре ассоциируются с мужским началом, силой, мощью, влиянием и др. Несмотря на то, что эти существительные неодушевленные и в основном обозначаются местоимением it, в литературе и в речи их часто персонифицируют и одушевляют, поэтому в определенном контексте они могут выражать мужской род.\n" +
            "\n" +
            "\tsun – солнце\n" +
            "\ttime – время\n" +
            "\tdeath – смерть\n" +
            "\tsummer – лето\n\n" +
            "\tThe sun was so scorching that it seemed he wanted to burn everything. – Солнце было настолько палящим, что казалось, оно хотело всё сжечь.\n" +
            "\tTime is cruel. He never waits. – Время жестоко. Оно никогда не ждет.\n" +
            "\nНа женский род существительного иногда указывают специальные суффиксы (-ine, -ess), который прибавляются к корню слова. Также может заменяться часть слова на соответствующую женского рода.\n" +
            "\n" +
            "\tactor → actress\n" +
            "\thero → heroine\n" +
            "\tlandlord → landlady\n" +
            "\tmanservant → maidservant\n" +
            "\nК женскому роду относят неодушевленные предметы и понятия (обозначаемые местоимением it), которые одушевляются говорящим и в культуре ассоциируются с женским началом, красотой, грацией, добротой.\n" +
            "\n" +
            "\tmoon – луна\n" +
            "\tearth – земля\n" +
            "\tspring – весна\n" +
            "\tcharity – благотворительность\n" +
            "\n\tWhen spring comes, she brings new life. – Когда приходит весна, она приносит новую жизнь.\n" +
            "\tThe Earth is our mother so we must take care of her. – Земля – наша мать, поэтому мы должны заботиться о ней.\n" +
            "\nИногда женский род приобретают существительные, обозначающие машину, корабль, лодку или страну. Женский род используется, чтобы подчеркнуть, что говорящий хорошо знаком с этим предметом.\n" +
            "\n" +
            "\tThis is my car. She is the best for me. – Это моя машина. Она самая лучшая для меня.\n" +
            "\tGermany is cool. She cares for her residents. – Германия классная. Она (страна) заботится о своих жителях.\n" +
            "\nК общему роду относятся существительные одушевленных объектов, гендерно нейтральные, то есть могут быть как мужского, так и женского рода в зависимости от контекста. Часто это названия профессий, род деятельности.\n" +
            "\n" +
            "\ta baby – малыш, малышка, ребенок\n" +
            "\ta doctor – доктор\n" +
            "\ta teacher – учитель, учительница\n" +
            "\tfriend – друг, подруга\n" +
            "\n\tWe have a new teacher. Her name is Mariam Johnson. – У нас новый учитель. Ее зовут Мариам Джонсон. (учитель женского пола)\n" +
            "\tOur teacher is strict. He always scolds us. – Наш учитель строгий. Он всегда нас ругает. (учитель мужского пола)\n" +
            "\n\n\nIt\n\n" +
            "Все неодушевленные предметы, понятия, явления, а также животные и собирательные существительные относятся к нейтральному среднему роду (neutral gender). Им соответствует местоимение it.\n" +
            "\n" +
            "\ta dog – собака\n" +
            "\ta country – страна\n" +
            "\ta tree – дерево\n" +
            "\tinformation – информация\n" +
            "\tcourage – смелость\n" +
            "\tlove – любовь\n" +
            "\nСуществительные, указывающие на животных, могут различаться по родам (мужскому и женскому), если необходимо подчеркнуть пол животного. В этом случае могут использоваться местоимения he или she вместо it, или специальные названия для этих животных.\n" +
            "\n" +
            "\tI bought a rat yesterday. I called her Boo. – Я купил крысу вчера. Я назвал ее Бу\n" +
            "\tMy dog is pretty old. He is 15 years old. – Мой пес довольно старый. Ему 15 лет.\n\n\n\n";

    static String someAnyNo = "Правила употребления some\n\n\n" +
            "1. Использование some с неисчисляемыми существительными в значении «немного»:\n" +
            "\n" +
            "\tThere is some tea in the cup. – В чашке есть немного чая.\n" +
            "\n\n" +
            "К неисчисляемым существительным английского языка, как правило, относятся такие категории существительных, как вещественные, абстрактные, то есть то, что нельзя посчитать.\n" +
            "\n\n" +
            "2. Также some употребляется с исчисляемыми существительными, стоящими во множественном числе в значении «несколько», «некоторые»:\n" +
            "\n" +
            "\tSome pupils brought interesting books. – Несколько учеников/ некоторые ученики принесли интересные книги.\n" +
            "\n\n" +
            "3.Еще один случай употребления неопределенного местоимения some – с исчисляемыми существительными в единственном числе, при этом значение будет «какой-то»: Some guy called and wanted to talk with you. – Звонил какой-то парень и хотел поговорить с тобой.\n" +
            "\n\n" +
            "Как правило, some и его производные употребляются в утвердительных предложениях, но также есть случаи, когда местоимение some используется в вопросительных предложениях.\n" +
            "\n" +
            "1. Когда мы хотим попросить о чем-то или наоборот, предложить что-то:\n" +
            "\n" +
            "\tWould you like some soup? – Не хотели бы Вы немного супа?\n" +
            "\n" +
            "\tCan I have some cold milk, please? – Можно мне холодного молока, пожалуйста?" +
            "2. Когда мы задаем вопрос, ответ на который предполагается быть утвердительным:\n" +
            "\n" +
            "\tWhat a smell! Are you cooking something tasty? – Какой запах! Ты готовишь что-то вкусненькое?\n" +
            "\n\n" +
            "Есть еще одно правило употребления some в английском языке. Местоимение some можно использовать с предлогом of в значении «некоторые из». В данном случае перед существительным необходимо поставить либо определенный артикль, либо указательное или притяжательное местоимение.\n" +
            "\n" +
            "\tSome of my friends are going to Moscow this week. – Некоторые из моих друзей собираются в Москву на этой неделе.\n" +
            "\n" +
            "\tSome of the houses were destroyed during the fire. – Некоторые из домов были разрушены во время пожара.\n" +
            "\n\n" +
            "Правило употребления местоимения any\n\n" +
            "Местоимение any и все его производные обычно употребляются в отрицательных и вопросительных предложениях:\n" +
            "\n" +
            "\tI don’t have any problems at school. –У меня нет проблем в школе.\n" +
            "\n" +
            "\tDo you have any news? – Есть какие-нибудь новости?\n" +
            "\n" +
            "Также есть правила для случаев, когда any употребляется в утвердительных предложениях:\n" +
            "\n" +
            "1. Когда имеется в виду «любой», «всякий», «что угодно», «где угодно», «как угодно»: Anyone can do this. – Любой может это сделать.\n" +
            "\n" +
            "2. В придаточных предложениях после «if»: If you have any questions let me know. – Если у вас будут вопросы, дайте знать.\n" +
            "\n" +
            "3. Если в предложении уже имеются нижеперечисленные наречия и предлог с отрицательным значением:\n" +
            "\n" +
            "Hardly\n" +
            "Scarcely\n" +
            "Never\n" +
            "Without\n" +
            "Seldom\n" +
            "Rarely\n\n" +
            "I seldom go anywhere at night. – Я очень редко выхожу куда-либо ночью.\n" +
            "\n" +
            "Without any doubt, he is a good person. – Без сомнения, он хороший человек.\n" +
            "\n" +
            "He never stays alone at home. – Он никогда не остается дома один.\n" +
            "\n\n" +
            "Если местоимение any употребляется с предлогом of, то на русский язык конструкция будет переводиться как «любой»:\n" +
            "\n" +
            "\tYou can take any of these books they are all very interesting. – Можешь взять любую из этих книг, они все очень интересные.\n" +
            "\n" +
            "Но стоит запомнить правило с any, что производные от местоимения, такие как anyone, anybody, anywhere, не могут использоваться с предлогом of.\n" +
            "\n" +
            "После производных местоимений можно использовать наречие else в значении «еще», «кроме».\n" +
            "\n" +
            "\tAre you going to tell me anything else? – Ты хочешь мне сказать что-то еще?\n" +
            "\n" +
            "\tDoes anybody need extra paper? – Кому-нибудь еще нужна бумага?\n" +
            "\n\n" +
            "Правило употребления some, any и артиклей a/an\n\n" +
            "Есть случаи, когда можно задуматься над выбором между some, неопределенным артиклем «а» и нулевым артиклем. Этот случай касается неисчисляемых существительных.\n" +
            "\n" +
            "\tCould you give me some water, please?\n" +
            "\tCould you give me a water, please?\n" +
            "\tCould you give me water, please?\n\n\n" +
            "Все три предложения переводятся как «Не могли бы вы дать мне воды, пожалуйста?». Разница состоит в том, что в первом предложении мы как бы просим небольшое количество жидкости, во втором, употребляя артикль «а», мы имеем в виду, что нам нужен один стакан или чашка воды, грубо говоря, одна «порция», а в третьем варианте мы имеем в виду, что нам важна вода, а не что-то другое, неважно в каком количестве.\n" +
            "\n" +
            "Правило употребления местоимения no\n" +
            "Местоимение no употребляется как перед исчисляемыми существительными, так и перед неисчисляемыми. Само предложение, в котором есть местоимение no приобретает отрицательное значение. Стоит отметить, что глагол в предложении с no будет всегда в положительной форме, поскольку двойного отрицания в английском языке нет.\n" +
            "\n" +
            "\tI have no tasks to do now. – Сейчас мне нечего делать.\n" +
            "\n" +
            "\tWe have no juice at home. Please, go to the shop. – У нас дома нет сока. Пожалуйста, сходи в магазин.\n\n\n\n";

    static String pronouns = "Местоимение — это часть речи, которая обозначает действующее лицо или предмет, но не называет его. В целом роль и значение местоимений в английском языке схожа с данной частью речи в русском. В этом статье мы рассмотрим виды английских местоимений с переводом и примеры их употребления.\n" +
            "\n" +
            "По своему значению местоимения английского языка делятся на следующие группы:\n" +
            "\n" +
            "\t1.личные\n" +
            "\t2.притяжательные\n" +
            "\t3.указательные\n" +
            "\t4.возвратные\n" +
            "\t5.вопросительные\n" +
            "\t6.отрицательные\n" +
            "\t7.неопределенные\n\n" +
            "Разберем отдельно каждую группу местоимений.\n" +
            "\n\n" +
            "Личные местоимения\n\n" +
            "Личные местоимения обозначают предметы или людей с точки зрения говорящего.\n" +
            "\n" +
            "Личные местоимения склоняются по родам, числам, падежам и лицам. " +
            "\nЛичные местоимения в именительном падеже, как правило, в предложении выступают в качестве подлежащих и отвечают на вопрос «кто?», «что?», а в объектном падеже играют роль дополнений. Объектный падеж местоимений в английском языке заменяет целых пять падежей русского (все, кроме именительного), и местоимения отвечают на вопросы этих падежей «кого, чего?», «кому, чему?», «кем, чем?», «о ком, о чем?».\n" +
            "\n" +
            "Разберем примеры употребления личных местоимений в английском языке.\n" +
            "\n" +
            "\tI don’t like rainy autumn weather. (Я не люблю дождливую осеннюю погоду).\n" +
            "\n\tShe is a very kind person. (Она очень добрый человек).\n" +
            "\n\tWhere are you from? (Откуда ты?)\n" +
            "\n\tThey have never been to Paris. (Они никогда не были в Париже).\n" +
            "\n\tGive him this book, please. (Дай ему, пожалуйста, эту книгу).\n" +
            "\n\tThe last episode of the series seemed very boring to me. (Последний эпизод сериала показался мне очень скучным).\n" +
            "\n\tUnfortunately, our elderly relatives don’t understand us very often. (К сожалению, наши пожилые родственники очень часто не понимают нас).\n" +
            "\n\tSorry, I didn’t hear you. Could you repeat, please? (Прошу прощения, я вас на услышал. Повторите, пожалуйста)." +
            "\n\n\nПритяжательные местоимения на английском языке, как и в русском, обозначают принадлежность к какому-либо предмету или лицу. Данный вид местоимений отвечает на вопрос «чей?»." +
            "\nПритяжательные местоимения в свою очередь делятся на 2 вида:\n" +
            "\n" +
            "Притяжательные местоимения зависимой формы." +
            "\n\nПриведем примеры предложений с притяжательными местоимениями зависимой формы.\n" +
            "\n\tWhat is your name? (Как твое имя?) My name is Margaret. (Меня зовут Маргарет).\n" +
            "\n\tLet me introduce my business partner Tom. (Разрешите мне представить моего бизнес-партнера Тома).\n" +
            "\n\tYesterday I met Jack with his new girlfriend. (Вчера я встретил Джека с его новой девушкой).\n" +
            "\n\tWhere do their children live now? (Где сейчас живут их дети?)\n" +
            "\n\tThis painting is the pride of our museum. It is beautiful. (Эта картина является гордостью нашего музея. Она прекрасна)."+
            "У притяжательных местоимений зависимой формы есть ряд особенностей:\n" +
            "\n" +
            "В английском языке нет слова «свой», вместо него используется соответствующее притяжательное местоимение. Например: I forgot my keys (Я забыл свои ключи). Every morning he walks his dog. (Каждое утро он гуляет со своей собакой).\n" +
            "Притяжательные местоимения не используются вместе с артиклями. Употребляется или артикль, или местоимение.\n" +
            "\nПритяжательные местоимения абсолютной формы."+
            "\n\nКак вы можете заметить, перевод у двух форм притяжательных местоимений одинаковый. В чем же отличие между ними?\n" +
            "\n" +
            "Притяжательные местоимения зависимой формы стоят перед существительным, принадлежность к которому они описывают. А притяжательные местоимения абсолютной формы употребляются без существительного после. Как правило, они ставятся в конце предложений.\n" +
            "\n" +
            "Разберем эту разницу на конкретных примерах:\n" +
            "\n" +
            "\tIs this my bag ? No, your bag is by the door, it is hers . (Это моя сумка? Нет, твоя сумка у двери, это её). В первых двух случаях использованы притяжательные местоимения зависимой формы (местоимение+существительное), а в последнем случае местоимение hers заменило словосочетание her bag.\n" +
            "\n" +
            "\tWhose cars are these? (Чьи это машины?)\n" +
            "\n" +
            "\tThis is my car, that is her car. (Это моя машина, а та ее машина). Или: This is mine, that is hers. (Это моя, а та ее).\n" +
            "\n" +
            "Приведем еще несколько примеров с абсолютной формой местоимений:\n" +
            "\n" +
            "\tHe is not Mary’s son. Hers has black hair. (Это не сын Мэри, у ее сына черные волосы).\n" +
            "\n\tI took my keys, but Albert forgot his. (Я взял свои ключи, но Альберт забыл свои).\n" +
            "\n\tIs this document yours? (Этот документ ваш?)\n" +
            "\nТакже притяжательные местоимения абсолютной формы можно использовать с предлогом of. Например:\n" +
            "\n" +
            "This is Nilson. He is a friend of mine. (Это Нильсон. Он мой друг).\n" +
            "\n" +
            "\nУказательные местоимения\n\n" +
            "Указательные местоимения служат для указание на предметы, людей, а также для описания времени.\n" +
            "\n" +
            "В английском языке пять указательных местоимений:\n" +
            "\n" +
            "\tthis — этот, эта, это\n" +
            "\tthat — тот, та, то\n" +
            "\tthese — эти\n" +
            "\tthose — те\n" +
            "\tsuch — такой\n" +
            "\nThis используются для указания на предметы, которые расположены в непосредственной близости от говорящего и представлены в единственном числе.\n" +
            "\n" +
            "\n\tThis is my house. (Это мой дом).\n" +
            "\n\tThis woman is my mother. (Эта женщина — моя мама).\n" +
            "\n\tThese используется для указания на предметы во множественном числе, которые также расположены в непосредственной близости от говорящего.\n" +
            "\n" +
            "\n\tThese flowers are wonderful. (Эти цветы великолепны).\n" +
            "\n\tThese are students from our school. (Это ученики с нашей школы).\n" +
            "\nThat используются для указания на предметы, которые расположены в отдалении говорящего и представлены в единственном числе.\n" +
            "\n" +
            "\tThat is my car. (То моя машина).\n" +
            "\n\tThat boy is our neighbour. (Тот мальчик наш сосед).\n" +
            "\tThose используются для указания на предметы, которые расположены в отдалении говорящего и представлены во множественном числе.\n" +
            "\n" +
            "\tThose are ancient monuments. (То древние памятники).\n" +
            "\n\tThose musicians are my friends. (Те музыканты мои друзья).\n" +
            "\nКроме того, this и that используются, когда мы делаем ссылку на отдаленность отрезка времени, о котором говорим.\n" +
            "\n" +
            "\tThis summer is very hot. (Это лето очень жаркое).\n" +
            "\n\tI visited Switzerland that summer. (Я посетил Швейцарию тем летом).\n" +
            "\nПоследнее указательное местоимение such переводится как «такой» и указывает на определенное качество предмета.\n" +
            "\n" +
            "\tShe is such a pretty girl. (Она такая милая девушка).\n" +
            "\n\tIt is such a difficult exam. (Это такой трудный экзамен).\n" +
            "\n\tDo it in such manner. (Сделай это таким способом).\n\n\n" +
            "Возвратные местоимения\n\n" +
            "Возвратные местоимения используют, когда действующие лица или предметы совершают действия, которые направлены на них самих. В русском языке возвратным местоимениям соответствует местоимение «себя», а также возвратный суффикс глагола -ся.\n" +
            "\n" +
            "Возвратные местоимения также используются когда нужно подчеркнуть, что кто-то выполнил действие самостоятельно."+
            "\n\tLet me introduce myself. (Разрешите мне представиться).\n" +
            "\n\tWe should be proud of ourselves. (Мы можем собой гордиться).\n" +
            "\n\tYou must do it yourself. (Ты должен сделать это сам).\n" +
            "\n\tHelp yourselves, please! (Угощайтесь, пожалуйста!)\n" +
            "\n\tMother cut herself making the salad. (Мама порезалась, делая салат).\n" +
            "\n\tOur parrot likes to look at itself in the mirror. (Наш попугай любит смотреть не себя в зеркало).\n" +
            "\n\tModern women can solve their problems themselves. (Современные женщины умеют сами решать свои проблемы).\n" +
            "\nВозвратные местоимения используются с предлогом by, если необходимо подчеркнуть, что действие совершается без посторонней помощи.\n" +
            "\n" +
            "\tI repaired my toy by myself. (Я сам починил свою игрушку).\n" +
            "\n\tCan the children do it by themselves? (Дети смогут сделать это сами?)\n" +
            "\n\tShe painted the fence by herself. (Она сама покрасила забор).\n" +
            "\nНе забудьте, что если речь идет о животном, то используется возвратное местоимение itself.\n" +
            "\n" +
            "Если пол действующего лица, о котором идет речь, не определен, то используется возвратное местоимение мужского пола (himself).\n" +
            "\n" +
            "Возвратные местоимения не используются со следующими глаголами:\n" +
            "\n" +
            "\tdress (одеваться)\n" +
            "\twash (мыться)\n" +
            "\tfeel (чувствовать)\n" +
            "\trelax (расслабляться)\n" +
            "\tmeet (встречаться)\n" +
            "\tafford (позволять)\n" +
            "\tfocus (сосредотачиваться)\n\n\n" +
            "Вопросительные местоимения\n\n" +
            "Вопросительные местоимения или вопросительные слова используются для построение специальных вопросов в английском языке.\n" +
            "\n" +
            "К вопросительным местоимениям относятся:\n" +
            "\n" +
            "\tWho? — Кто?\n" +
            "\tWhat? — Что?\n" +
            "\tWhere? — Где? Куда?\n" +
            "\tWhen? — Когда?\n" +
            "\tWhy? — Почему?\n" +
            "\tHow? — Как?\n" +
            "\tWhich? — Который?\n" +
            "\tWhose? — Чей?\n" +
            "\tWhere are you from? (Откуда ты?)\n" +
            "\tWhose bicycle is this? (Чей это велосипед?)\n" +
            "\tWhy does he live here? (Почему он живет здесь?)\n" +
            "\tHow are they? (Как у них дела?)\n" +
            "\tWhat is this noise? (Что это за шум?)\n" +
            "\tWhich country did you like best? (Какая страна вам больше всего понравилась?)\n\n\n" +
            "Отрицательные местоимения\n\n" +
            "Отрицательные местоимения служат для придания предложениям отрицательного смысла и значения.\n" +
            "\n" +
            "К отрицательным местоимениям в английском языке относят следующие слова:\n" +
            "\n" +
            "\tno — никакой\n" +
            "\tnothing — ничего, ничто\n" +
            "\tnobody — никто\n" +
            "\tno one — никто\n" +
            "\tnone — ни один из\n" +
            "\tneither — ни тот ни другой, ни один, никто\n\n\n" +
            "Местоимения no ставится перед существительными в качестве местоимения-прилагательного. При этом с данным существительным не употребляются другие местоимения и артикли.\n" +
            "\n" +
            "\tNo magazine wrote about this case. (Ни один журнал не написал об этом случае).\n" +
            "\n" +
            "\tHe has no idea how to solve the problem. (У него нет никаких идей, как решить эту проблему).\n" +
            "\n\n" +
            "Местоимение none используется в качестве местоимения-существительного. В предложении оно может играть роль подлежащего и дополнения.\n" +
            "\n" +
            "\tNone of us has never been here before. (Никто из нас не был здесь раньше).\n" +
            "\n" +
            "\tUnfortunately, I helped none of my friends yesterday. (К сожалению, вчера я не помог никому из своих друзей).\n" +
            "\n" +
            "\tNothing используется только с неодушевленными существительными. С одушевленными используются nobody и no one.\n" +
            "\n" +
            "\tNo one wants to take this homeless puppy. (Никто не хочет взять этого бездомного щенка).\n" +
            "\n" +
            "\tI need nothing from the shop. (Мне ничего не нужно из магазина).\n" +
            "\n" +
            "\tThere was nobody at home when I came yesterday. (Никого не было дома, когда я пришел вчера).\n" +
            "\n\n" +
            "Местоимение neither может выступать как в роли местоимения-существительного, так и местоимения-прилагательного, как с одушевленными, так и неодушевленными предметами.\n" +
            "\n" +
            "\tNeither book was interesting for me. (Ни одна из книг не была мне интересна).\n" +
            "\n" +
            "\tWould you like an ice-cream or some pudding? Neither. (Вы бы хотели мороженое или пудинг? Ни то, ни другое).\n" +
            "\n\n" +
            "Обратите внимание, что в английском языке не используется двойное отрицание. То есть, если вы используете отрицательное местоимения, то дополнительно строить отрицательную конструкцию предложения с частицей not не нужно.\n" +
            "\n\n" +
            "Неопределенные местоимения\n\n" +
            "Когда мы не можем указать точно какое-либо лицо, предмет, количество, то мы используем неопределенные местоимения. В английском языке к неопределенным относят производные местоимения от some, any, no.\n" +
            "\n" +
            "Some и его производные употребляются в утвердительных предложениях, а any, no и их производные — в отрицательных." +
            "Рассмотрим применение неопределенных местоимений на примерах:\n" +
            "\n" +
            "\tSomeone has been here recently. (Кто-то был здесь недавно).\n" +
            "\n\tAnyone can do it! (Любой может сделать это).\n" +
            "\n\tThis path is getting us nowhere. (Эта тропинка никуда нас не приведет).\n" +
            "\n\tCan anybody help me? (Кто-нибудь может мне помочь?)\n" +
            "\n\tI want to go somewhere for the weekend. (Я хочу уехать куда-нибудь на выходные).\n" +
            "\n\tNobody liked this film. (Никому не понравился этот фильм).\n\n" +
            "Итак, мы рассмотрели основные виды местоимений в английском языке. Употребляйте их, чтобы сделать вашу речь более яркой и понятной.\n\n\n\n";


    static String degree = "Образование сравнительной степени прилагательных в английском языке\n" +
            "Рассмотрим образование сравнительной степени прилагательных на примере. Возьмем две дороги. Одна из них двухполосная, вторая — четырехполосная. Следовательно, вторая дорога шире, чем первая. Сравнить предметы можно при помощи слова than (чем, нежели):\n" +
            "\n" +
            "This road is broader than that one. — Эта дорога шире, чем та.\n" +
            "Do you think that Maddie is more beautiful than Jane? — Ты думаешь, что Мэдди более красивая, чем Джейн?\n" +
            "My mother is taller than her sister. — Моя мама выше, чем ее сестра.\n" +
            "\n" +
            "При образовании сравнительной степени прилагательных в английском языке необходимо учитывать длину прилагательного. Измерять эту длину надо слогами.\n\n" +
            "Прилагательное длиной в один слог — big (большой), small (маленький), thin (тонкий), cute (забавный), cold (холодный) — называется односложным.\n" +
            "\n" +
            "Прилагательное длиной в два слога — mod-ern (современный), bus-y (занятой), clev-er (умный), pret-ty (красивый) — двусложное.\n" +
            "\n" +
            "Прилагательное длиной в три и более слогов — beau-ti-ful (красивый), con-fi-den-tial (секретный), de-fen-sive (защищающий) — многосложное.\n\n"
            + "Особенности образования сравнительной степени прилагательных в английском языке:\n" +
            "\n" +
            "Если прилагательное односложное, сравнительная степень образуется путем добавления к прилагательному суффикса -(e)r.\n" +
            "\t\ncold (холодный) – colder (холоднее)\n" +
            "\twarm (теплый) – warmer (теплее)\n" +
            "\tcool (прохладный) – cooler (прохладнее)\n" +
            "\tsafe (безопасный) – safer (безопаснее)\n" +
            "\tcute (забавный) – cuter (забавнее)\n" +
            "\twide (широкий) – wider (шире)\n" +
            "\n" +
            "\tIn Canada I got used to colder winters. — В Канаде я привык к более холодным зимам.\n" +
            "\n\tKate’s dog is cuter than Ann’s. — Пес Кейт милее, чем пес Энн.\n" +
            "\n" +
            "Если прилагательное оканчивается на сочетание гласная + согласная, то конечная согласная удваивается.\n" +
            "\n" +
            "\tbig (большой) – bigger (больше)\n" +
            "\tthin (тонкий, худой) – thinner (тоньше, худее)\n" +
            "\tfat (толстый, жирный) – fatter (толще, жирнее)\n" +
            "\n" +
            "\tThe cuts were thinner but deeper. — Разрезы были тоньше, но более глубокие.\n" +
            "\t\nI need a fatter piece of meat than that. — Мне нужен более жирный кусок мяса, чем этот.\n" +
            "\t\nMy bedroom is bigger than the living room. — Моя комната больше гостиной.\n" +
            "\t\nJuly this year is hotter, I think. — Июль в этом году жарче, мне кажется.\n\n" +
            "Особенности образования сравнительной степени двусложных прилагательных:\n" +
            "К двусложным прилагательным, которые оканчиваются на звуки /r/, /l/ или безударный гласный звук, добавляем суффикс -(e)r.\n" +
            "\n\tclever /ˈklevər/ (умный) – cleverer (умнее)\n" +
            "\n\tnoble /ˈnəʊbl/ (благородный) – nobler (самый благородный)\n" +
            "n\n\tarrow /ˈnærəʊ/ (узкий) – narrower (у́же)\n" +
            "\n" +
            "Если прилагательное оканчивается на -y, она меняется на -i.\n" +
            "\n\tbusy (занятой) – busier (более занятой)\n" +
            "\n\tcosy (уютный) – cosier (уютнее)\n" +
            "\n" +
            "\n\tThe house in the mountains was cosier compared to the house we rented at the seaside. — Дом в горах был уютнее по сравнению с домом, который мы снимали на побережье.\n" +
            "\n\tNew York streets are busier than Philadelphian ones. — Нью-Йоркские улицы более оживленные, нежели филадельфийские.\n" +
            "\n\tA cleverer student will get an opportunity to go to the contest. — Более умный студент получит возможность поехать на состязание.\n\n" +
            "\n\tПрилагательные, которые оканчиваются на -ing, -ed, -ful и -less, образуют сравнительную степень с помощью more.\n" +
            "\n\tthankful (благодарный) – more thankful (более благодарный)\n" +
            "\n\tamusing (забавный) – more amusing (более забавный)\n" +
            "\n" +
            "\n\tMy previous job was more stressful than this one. — Моя предыдущая работа была более напряженной, чем эта.\n" +
            "\n" +
            "\nУ некоторых двусложных прилагательных есть две формы образования сравнительной степени: с окончанием -(e)r и с помощью слова more.\n" +
            "\n\tpolite (вежливый) – politer / more polite (более вежливый)\n" +
            "\n" +
            "Если прилагательное многосложное, тогда сравнительную степень от него образовываем, ставя перед ним слово more:\n" +
            "\n\tmodern (современный) – more modern (современнее)\n" +
            "\n\tfamous (знаменитый) – more famous (знаменитее)\n" +
            "\n\tinteresting (интересный) – more interesting (интереснее)\n" +
            "\n\tbeautiful (красивый) – more beautiful (красивее)\n" +
            "\n\tunexpected (неожиданный) – more unexpected (неожиданнее)\n" +
            "\n" +
            "\tIt is a more interesting book, believe me. — Это более интересная книга, поверь мне.\n" +
            "\n\tYou are more beautiful than she ever was. — Ты красивее, чем она когда-либо была.\n\n" +
            "В образовании степеней сравнения прилагательных есть исключения:\n" +
            "good (хороший) – better (лучше)\n" +
            "bad (плохой) – worse (хуже)\n" +
            "far (далекий) – farther/further (дальше)\n" +
            "old (старый) – older/elder (старше)\n" +
            "\n" +
            "There is no better option. — Нет лучшего варианта.\n" +
            "They say I can find a doctor in a farther village. — Они говорят, что я смогу найти врача в более отдаленной деревне.\n" +
            "The situation got worse when I saw the expression on her face. — Ситуация стала еще хуже, когда я увидел выражение ее лица.\n\n"+
            "Обратите внимание, что прилагательное far имеет два варианта сравнительной степени. Выбор нужной формы зависит от смысла слова. Когда речь идет о расстоянии, не имеет значения, какую форму выбрать.\n" +
            "\n" +
            "It was a farther/further school. — Это была более отдаленная школа.\n" +
            "\n" +
            "Если мы хотим употребить это прилагательное в значении «дальнейший», «добавочный», тогда используем исключительно further.\n\n"+
            "\nОбразование превосходной степени прилагательных в английском языке\n" +
            "Вернемся к нашему примеру с дорогами. Первая — двухполосная, вторая — четырехполосная, а третья — шестиполосная.\n" +
            "\n" +
            "The first road is broader than the second one, but the third road is the broadest. — Первая дорога шире второй, но третья дорога самая широкая.\n" +
            "\n" +
            "Давайте рассмотрим особенности формирования превосходной степени английских прилагательных:\n" +
            "\n" +
            "Если прилагательное односложное, его превосходная степень образуется путем прибавления суффикса -(e)st, а перед прилагательным ставится определенный артикль the. Если есть другие слова-определители, например притяжательное местоимение, артикль the опускается.\n" +
            "cold (холодный) – the coldest (самый холодный)\n" +
            "warm (теплый) – the warmest (самый теплый)\n" +
            "cool (прохладный) – the coolest (самый прохладный)\n" +
            "safe (безопасный) – the safest (самый безопасный)\n" +
            "cute (забавный) – the cutest (самый забавный)\n" +
            "wide (широкий) – the widest (самый широкий)\n\n"+
            "Если прилагательное оканчивается на сочетание гласная + согласная, конечная согласная удваивается:\n" +
            "\n" +
            "big (большой) – the biggest (самый большой)\n" +
            "thin (тонкий, худой) – the thinnest (самый тонкий, самый худой)\n" +
            "fat (толстый, жирный) – the fattest (самый толстый, самый жирный)\n" +
            "\n" +
            "I want to find a recipe of a cake with the fattest layer of chocolate. — Хочу найти рецепт торта с самым толстым слоем шоколада.\n" +
            "She chose the biggest teddy. — Она выбрала самого большого плюшевого медведя.\n" +
            "In my opinion, Jack must start with the thinnest book. — По моему мнению, Джеку надо начать с самой тонкой книги.\n" +
            "\n" +
            "Особенности образования превосходной степени двусложных прилагательных:\n" +
            "К двусложным прилагательным, которые оканчиваются на звуки /r/, /l/ или безударный гласный звук, присоединяем суффикс -(e)st. Не забываем, что перед прилагательным необходимо поставить определенный артикль the.\n" +
            "clever (умный) – the cleverest (умнейший)\n" +
            "noble (благородный) – the noblest (благороднее)\n" +
            "narrow (узкий) – the narrowest (самый узкий)\n" +
            "\n" +
            "Если прилагательное оканчивается на -y, она меняется на -i.\n" +
            "friendly (дружелюбный ) – the friendliest (самый дружелюбный)\n" +
            "trendy (модный) – the trendiest (самый модный)\n" +
            "\n" +
            "Cindy is the friendliest kid in the class. — Синди — самый дружелюбный ребенок в классе.\n" +
            "The remark was the cleverest I had ever heard. — Замечание было самым умным из всех, что я когда-либо слышал.\n" +
            "They chose the narrowest path because it was the shortest. — Они выбрали самую узкую тропу, потому что она была самой короткой.\n" +
            "\n" +
            "Прилагательные, которые оканчиваются на -ing, -ed, -ful и -less, образуют превосходную степень с помощью the most.\n" +
            "thankful (благодарный) – the most thankful (самый благодарный)\n" +
            "amusing (забавный) – the most amusing (самый забавный)\n" +
            "\n" +
            "Let’s watch the most joyful film I’ve ever seen again! — Давай еще раз посмотрим самый веселый фильм, который я когда-либо видел.\n" +
            "\n" +
            "У некоторых двусложных прилагательных есть две формы сравнительной степени: the перед прилагательным с окончанием -(e)st или the most перед прилагательным.\n" +
            "polite (вежливый) – the politest / the most polite (самый вежливый)\n" +
            "\n" +
            "Многосложные прилагательные образуют превосходную степень с помощью the most перед прилагательным.\n" +
            "modern (современный) – the most modern (самый современный)\n" +
            "famous (знаменитый) – the most famous (самый знаменитый)\n" +
            "interesting (интересный) – the most interesting (самый интересный)\n" +
            "beautiful (красивый) – the most beautiful (самый красивый)\n" +
            "unexpected (неожиданный) – the most unexpected (самый неожиданный)\n\n"+
            "Исключения в образовании превосходной степени прилагательных:\n" +
            "good (хороший) – the best (лучший)\n" +
            "bad (плохой) – the worst (худший)\n" +
            "far (далекий) – the farthest / the furthest (самый дальний)\n" +
            "old (старый) – the oldest (самый старый) / the eldest (самый старший)\n\n\n"+
            "Less и the least\n" +
            "Используем less, когда хотим отметить, что предмет/человек обладает каким-то качеством в меньшей степени, чем другие, а the least — в наименьшей степени.\n" +
            "\n" +
            "hard (тяжелый) – less hard (менее тяжелый) – the least hard (наименее тяжелый)\n" +
            "famous (известный) – less famous (менее известный) – the least famous (наименее известный)\n" +
            "beautiful (красивый) – less beautiful (менее красивый) – the least beautiful (наименее красивый)\n" +
            "\n" +
            "She is now a less famous actress than 20 years ago. — Сейчас она менее известная актриса, чем 20 лет назад.\n" +
            "Let’s choose a less expensive hotel. — Давай выберем менее дорогой отель.\n" +
            "First, I offer to choose the least beautiful dress. — Сначала я предлагаю выбрать наименее красивое платье.\n" +
            "The least tiring journey was to Los Angeles because they took the train. — Наименее выматывающим было путешествие в Лос-Анджелес потому что они поехали на поезде.\n\n\n\n";

    static String prepositions = "Когда мы хотим сказать о месторасположении, необходимы английские предлоги места . Именно они указывают, где находится предмет в пространстве и как он расположен относительно других объектов.\n" +
            "\n" +
            "Если убрать из предложения все предлоги места, то во фразе останутся существительные, обозначающие объекты, но отношение между ними станут непонятными. Например, в русском языке значение расположения во фразе «рядом с / над / под полкой» определяется именно предлогом.\n" +
            "\n" +
            "Чтобы уметь говорить о том, что где находится, разберем все основные предлоги места в английском.\n" +
            "\n" +
            "Основные предлоги места: in / at / on\n" +
            "Три главных предлога места в английском — in, at, on. Они наиболее распространены и встречаются в большом количестве конструкций.\n" +
            "\n" +
            "Значения предлогов in / at / on:\n" +
            "\n" +
            "in — в, в пределах: in the car — в машине\n" +
            "at — в определенной точке, около ориентира: at the table — за столом\n" +
            "on — на поверхности: on the table — на столе\n" +
            "Различие в использовании этих предлогов места в английском языке не всегда можно вывести из их основных значений. Некоторые употребления зафиксированы в языке, и их нужно запомнить. Чтобы разобраться, когда используется каждый из предлогов, посмотрим подробнее на случаи их употребления.\n" +
            "\n" +
            "Предлог in\n" +
            "Предлог in указывает на нахождение объекта внутри определенных границ. Обозначим, в каких ситуациях используется этот предлог:\n" +
            "\n" +
            "Местность или пространство, в которой находится объект:\n" +
            "\n" +
            "in the woods — в лесу\n" +
            "in the sky — на/в небе\n" +
            "Don’t get lost in the woods — Не потеряйся в лесу.\n" +
            "\n" +
            "Нахождение в помещении:\n" +
            "\n" +
            "in the building — в здании\n" +
            "I don’t feel comfortable in your room — Я чувствую себя неуютно в твоей комнате.\n" +
            "\n" +
            "\n" +
            "С названиями стран, регионов и сторон света:\n" +
            "\n" +
            "in Russia — в России\n" +
            "in Moscow — в Москве\n" +
            "in the west — на западе\n" +
            "I’ve lived in Berlin for six years — Я живу в Берлине шесть лет.\n" +
            "\n" +
            "Английский предлог места in отсылает к содержанию бумажных изданий, фотографий, картин:\n" +
            "\n" +
            "in the photo — на фотографии\n" +
            "in the newspaper — в газете\n" +
            "All you need to know is written in this book — Все, что тебе нужно знать, написано в этой книге.\n" +
            "\n" +
            "Отражение в зеркале:\n" +
            "\n" +
            "in the mirror — в зеркале\n" +
            "She stared at her reflection in the mirror — Она уставилась на свое отражение в зеркале.\n" +
            "\n" +
            "Устойчивые выражения:\n" +
            "\n" +
            "in the mood — в настроении\n" +
            "be in the pink — быть в расцвете сил\n" +
            "Stop making jokes, I’m not in the mood today — Хватит шутить, я сегодня не в настроении.\n" +
            "\n" +
            "Предлог at\n" +
            "Предлог at может иметь значение «в» или «около». Этот английский предлог места указывает на выбранную точку или ориентир расположения.\n" +
            "\n" +
            "Предлог at используется с посещением учреждений, когда необходимо обозначить не нахождение внутри помещения, а определить принадлежность к определенному роду деятельности:\n" +
            "\n" +
            "at school — в школе\n" +
            "at university — в университете\n" +
            "at work — на работе\n" +
            "at the library — в библиотеке\n" +
            "I never got a single prize while I was at school — Когда я учился в школе, я никогда не получал никаких наград.\n" +
            "\n" +
            "He got this book at the library — Эту книгу он взял в библиотеке.\n" +
            "\n" +
            "Речь может идти не только об учреждении, но и о мероприятиях:\n" +
            "\n" +
            "at a lecture — на лекции\n" +
            "at a conference — на конференции\n" +
            "at a concert — на концерте\n" +
            "I’ll see John tomorrow at the lecture — Я увижу Джона завтра на лекции.\n" +
            "\n" +
            "Предлог at имеет также значение близости к объекту:\n" +
            "\n" +
            "at the door — у двери\n" +
            "at the table — за столом\n" +
            "There's a woman at the door, asking for Mr Smith — Какая-то женщина у входа спрашивает мистера Смита.\n" +
            "\n" +
            "At фиксирует точку местонахождения:\n" +
            "\n" +
            "at the bus station — на автобусной остановке\n" +
            "Let's meet at the bus station — Давай встретимся на автобусной остановке.\n" +
            "Узнать больше\n" +
            "\n" +
            "Этот английский предлог места употребляется в устойчивых словосочетаниях:\n" +
            "\n" +
            "at the top of — на вершине, наверху\n" +
            "at the bottom of — внизу\n" +
            "We had to stop at the top of the hill and wait for the engine to cool down — Нам пришлось остановиться на вершине холма и дать двигателю остыть.\n" +
            "\n" +
            "Предлог on\n" +
            "Основное значение предлога on — указание на поверхность:\n" +
            "\n" +
            "on the floor — на полу\n" +
            "I knelt down to play with the baby on the floor — Я опустился на колени, чтобы поиграть с ребенком на полу.\n" +
            "\n" +
            "Слово floor может также употребляться в значении «этаж». Английский предлог места в таком контексте остается прежним:\n" +
            "\n" +
            "on the… floor — на…этаже\n" +
            "\n" +
            "I’m used to live on the first floor — Я привык жить на первом этаже.\n" +
            "\n" +
            "Способ передвижения и транспорт:\n" +
            "\n" +
            "on the bus — в автобусе\n" +
            "on foot — пешком\n" +
            "There is free wi-fi on the train — В поезде есть бесплатный wi-fi.\n" +
            "\n" +
            "Предлог on употребляется также при указании на дорогу или путь:\n" +
            "\n" +
            "on the road — на дороге\n" +
            "on my way — в пути\n" +
            "There was heavy traffic on the roads — На дорогах было интенсивное движение.\n" +
            "\n" +
            "Страницы:\n" +
            "\n" +
            "on the page — на странице\n" +
            "This exercise is on page 14 — Это упражнение на странице 14.\n" +
            "Узнать больше\n" +
            "\n" +
            "Списки и карты:\n" +
            "\n" +
            "on the map — на карте\n" +
            "on the menu — в меню\n" +
            "I cannot find his name on the guest list — Я не могу найти его имя в списке гостей.\n" +
            "\n" +
            "С мультимедийными средствами информации:\n" +
            "\n" +
            "on television — по телевизору\n" +
            "on the radio — по радио\n" +
            "I’ve heard this song on the radio — Я услышал эту песню по радио.\n" +
            "\n" +
            "Словосочетания «слева» / «справа»:\n" +
            "\n" +
            "on the left — слева\n" +
            "on the right — справа\n" +
            "You will see the hospital on the left — Вы увидите больницу слева.\n" +
            "\n" +
            "Другие выражения:\n" +
            "\n" +
            "on holiday — в отпуске\n" +
            "on sale — в продаже\n" +
            "on business — по делу\n" +
            "Who will double for the secretary while she is on holiday? — Кто будет замещать секретаря, пока она в отпуске?\n" +
            "\n" +
            "Различия между at / in / on\n" +
            "Часто эти предлоги места в английском языке употребляются в схожих контекстах. На такие случаи нужно обратить особое внимание.\n" +
            "\n" +
            "Например, в следующих словосочетаниях предлоги различаются:\n" +
            "\n" +
            "in the armchair — в кресле\n" +
            "on the chair — на стуле\n" +
            "Также нужно запомнить следующую пару слов:\n" +
            "\n" +
            "in bed — в постели, в кровати\n" +
            "on the sofa — на диване\n" +
            "She threw herself down on the sofa — Она упала на диван.\n" +
            "\n" +
            "Выражение in bed (в постели) используется не только в буквальном значении, но и как указание на постельный режим:\n" +
            "\n" +
            "The patient must remain in bed — Больному нельзя вставать.\n" +
            "\n" +
            "Не всегда учреждения обязательно используются с предлогом at, существуют также выражения с in:\n" +
            "\n" +
            "in hospital — в больнице\n" +
            "in prison — в тюрьме\n" +
            "Henry takes charge of it while I am in the hospital — Об этом позаботится Генри, пока я в больнице.\n" +
            "\n" +
            "Различается использование английских предлогов места , и когда мы говорим о доме в значении здания или как об определенного рода территории:\n" +
            "\n" +
            "at home — дома\n" +
            "in the house — в доме (то есть в здании, в помещении)\n" +
            "I want to stay at home — Я хочу остаться дома.\n" +
            "\n" +
            "I was at my granny’s house — Я был в доме моей бабушки.\n" +
            "\n" +
            "It’s so cold in her house — У нее в доме так холодно.\n" +
            "Узнать больше\n" +
            "\n" +
            "Для описания средства передвижения употребляется предлог on:\n" +
            "\n" +
            "on the plane — на самолете\n" +
            "on the train — на поезде\n" +
            "Но когда необходимо подчеркнуть местонахождение внутри, используется предлог in:\n" +
            "\n" +
            "I left my bag in the bus — Я забыл свою сумку в автобусе.\n" +
            "\n" +
            "Когда мы говорим о содержании страницы, то употребляем предлог on (on the page — на странице). Но если речь идет о странице книги как о физическом объекте, то употребляется предлог at:\n" +
            "\n" +
            "When the teacher saw the boy squinting at the page, she thought that he might need glasses — Когда учительница заметила, что мальчик щурится, глядя на страницу, она подумала, что ему не помешают очки.\n" +
            "\n" +
            "I opened the book at page 44 — Я открыл книгу на странице 44.\n" +
            "\n" +
            "Другие предлоги места в английском\n" +
            "Возможности указать на расположение предмета в пространстве не ограничиваются at, in и on. Предлоги места в английском языке гораздо более разнообразны. Чтобы было удобнее в них разобраться, разобьем список предлогов на группы с близкими или противоположными значениями.\n" +
            "\n" +
            "Над / под:\n" +
            "\n" +
            "above — выше уровня: The note was put above the door — Объявление было приклеено над дверью.\n" +
            "below — ниже уровня: As the sun went down below the horizon, the sky became pink — Когда солнце зашло за горизонт (опустилось ниже горизонта), небо стало розовым.\n" +
            "over — над: He flew over the sea — Он летел над морем.\n" +
            "under — под: Under the stairs there was a storage closet — Под лестницей была кладовка.\n" +
            "Спереди / сзади:\n" +
            "\n" +
            "before — перед: Everyone fell on the knees before the queen — Все упали на колени перед королевой.\n" +
            "behind — за, позади: The church is behind these trees — Церковь находится за этими деревьями.\n" +
            "Между, среди:\n" +
            "\n" +
            "among — среди: There were lots of famous musicians among the guests — Среди гостей было много известных музыкантов.\n" +
            "between — между: The ship goes between the two islands. — Корабль курсирует между двумя островами.\n" +
            "Сходные английские предлоги места among и between имеют различное употребление. Between обозначает нахождение между двумя объектами, а among — среди множества объектов.\n" +
            "\n" +
            "Близко / далеко:\n" +
            "\n" +
            "by — у, рядом с: We got a house by a river — Мы купили дом у реки.\n" +
            "near — вблизи, около: There is a rosebush near the fence — Около ограды растет розовый куст.\n" +
            "beside — рядом с, возле: You shall stand beside me in the church — Ты будешь стоять рядом со мной в церкви.\n" +
            "next to — рядом, вблизи: I arranged that they should be seated next to each other — Я договорился, что их посадят рядом.\n" +
            "beyond — за, по ту сторону: The valley where we live is beyond these mountains — Долина, в которой мы живем, расположена за этими горами.\n" +
            "Напротив:\n" +
            "\n" +
            "across — на другой стороне: And then she saw one of her good friends across the street — И тут она увидела одну из своих старых подруг на другой стороне улицы.\n" +
            "opposite — напротив: They stood opposite each other — Они стояли напротив друг друга.\n" +
            "in front of — перед, напротив: The car has stopped in front of the gate — Машина остановилась напротив ворот.\n" +
            "Внутри / снаружи:\n" +
            "\n" +
            "inside — внутри, в: The car wasn’t inside the garage — В гараже машины не было.\n" +
            "outside — вне, за пределами: Outside the building people are still waiting — Люди за стенами здания по-прежнему ждут.\n" +
            "Направление и траектория\n" +
            "Предлоги места в английском языке могут описывать не только положение предмета в пространстве, но и направление движения. Разница в описании «где» или «куда» чаще всего определяется глаголом, а предлог остается неизменным. Например, словосочетание on the table в изолированном виде может переводиться как «на столе» или «на стол»:\n" +
            "\n" +
            "I saw a book on the table — Я видел книгу на столе.\n" +
            "\n" +
            "I put the book on the table — Я положил книгу на стол.\n" +
            "\n" +
            "Однако существуют специальные предлоги, которые указывают на направление действия:\n" +
            "\n" +
            "to — к: Please, come to me — Пожалуйста, подойди ко мне.\n" +
            "towards — в направлении к: Everybody's eyes were directed towards him — Взгляд каждого был обращен на него .\n" +
            "into — внутрь: She got back after lunch and ran the car into the garage — Она вернулась после завтрака и поставила машину в гараж.\n" +
            "onto — на, наверх: The dog jumped onto the sofa — Собака прыгнула на диван.\n" +
            "from — из, с, от (направление из исходной точки): Water dropped from the ceiling into the pan on the floor — Вода капала с потолка в стоящий на полу таз.\n" +
            "Существуют также предлоги траектории, которые указывают на характер передвижения:\n" +
            "\n" +
            "across — через, сквозь, поперек: Use a boat to get across the river — Используй лодку, чтобы переправиться через реку.\n" +
            "through — через, по: Walking through the forest one day, we found a little hut — Однажды, гуляя по лесу, мы обнаружили маленькую хижину.\n" +
            "Конечно, английские предлоги места , направления и траектории могут использоваться не только в прямом значении, но и в переносном смысле. Например, through употребляется в конструкции live through (пережить): live through the night (пережить эту ночь). А предлог under активно используется с абстрактными существительными: under the influence of smb (под влиянием кого-то), under pressure (под давлением). Он же фигурирует в выражении get smb under one’s skin, буквально «иметь кого-то под кожей», то есть «досаждать» или «производить большое впечатление».\n\n\n\n";

    static String infinitive = "Инфинитив в активном залоге\n" +
            "Простой инфинитив (Indefinite или Simple Infinitive) обозначает действие, которое происходит одновременно с действием, выраженным глаголом в личной форме. В этом случае время действия определяется по глаголу-сказуемому, стоящему в личной форме.\n" +
            "\n" +
            "I am glad to meet Peter. – Я рад встретиться с Питером.\n" +
            "I was glad to meet Peter. – Я был рад встретиться с Питером.\n" +
            "I will be glad to meet Peter. – Я буду рад встретиться с Питером.\n" +
            "Продолжительный инфинитив (Continuous или Progressive Infinitive) обозначает продолжительное действие, происходящее одновременно с другим действием, выраженным глаголом-сказуемым в личной форме.\n" +
            "\n" +
            "The weather seems to be changing. – Кажется, погода меняется (будет сейчас меняться).\n" +
            "The weather seemed to be changing. – Казалось, что погода меняется.\n" +
            "He will be glad to be swimming in a cool pool right now. – Он будет счастлив поплавать сейчас в прохладном бассейне.\n" +
            "Совершенный инфинитив (Perfect Infinitive) употребляется для обозначения действия или состояния, которое было выполнено перед другим действием, на которое указывает глагол-сказуемое.\n" +
            "\n" +
            "It is very nice of Matt to have come to us. – Это замечательно, что Мэтт пришел к нам.\n" +
            "It was very nice of Matt to have come to us. – Это было замечательно, что Мэтт пришел к нам.\n" +
            "She will pretend to have lost all her money. – Она сделает вид, что потеряла все свои деньги.\n" +
            "Совершенный инфинитив после глаголов to mean (намереваться), to hope (надеяться), to intend (намереваться), to expect (ожидать) в форме Past Simple указывает на то, что действие должно было случиться, но не случилось.\n" +
            "\n" +
            "We meant to have gone there. – Мы собирались пойти туда.\n" +
            "Ann hoped to have arrived in time. – Энн надеялась, что прибудет вовремя.\n" +
            "Chris intended to have married Jane. – Крис собирался жениться на Джейн.\n" +
            "I expected you to have finished your work already. – Я надеялась, что ты уже закончил свою работу.\n" +
            "Совершенно-продолжительный инфинитив (Perfect Continuous Infinitive) указывает на действие, которое продолжалось некоторое время до действия, выраженного глаголом в личной форме (глагол-сказуемого), или до сих пор продолжается. Этот инфинитив подчеркивает длительность действия.\n" +
            "\n" +
            "Jack seems to have been living here since his childhood. – Кажется, Джек живет здесь с детства.\n" +
            "I was glad to have been working there for 10 years. – Я был рад проработать там 10 лет. \n" +
            "Paul will be happy to have been working here for all his life. – Пол будет рад проработать здесь всю свою жизнь.\n" +
            "Инфинитив в пассивном залоге\n" +
            "Простой инфинитив пассивного залога (Passive Indefinite Infinitive) выражает действие над кем-то или чем-то, которое происходит одновременно с действием, выраженным глаголом в личной форме – глаголом-сказуемым.\n" +
            "\n" +
            "She ought to be told the truth. – Ей должны сказать правду.\n" +
            "This letter needs to be written today. – Это письмо должно быть написано сегодня.\n" +
            "I liked to be given a lot of presents when I was small. – Мне нравилось получать много подарков, когда я был маленьким.\n" +
            "Совершенный инфинитив пассивного залога (Passive Perfect Infinitive) употребляется для обозначения действия в пассивном залоге, которое происходило до действия или состояния, выраженного глаголом-сказуемым.\n" +
            "\n" +
            "This house seems to have been rebuilt already. – Кажется, этот дом уже перестроили.\n" +
            "I supposed the work to have been done by that time. – Я считала, что работа была выполнена к тому времени.\n" +
            "This book must have been written by Dickens. – Эта книга, должно быть, написана Диккенсом. (голый инфинитив после модального глагола)\n" +
            "В предложениях, которые начинаются с конструкции there is, некоторые переходные глаголы могут быть использованы как в пассивном инфинитиве, так и в активном без изменения значения предложения.\n" +
            "\n" +
            "There is nothing to love. – Нет ничего, что можно любить (нечего любить).\n" +
            "There is nothing to be loved. – Нет ничего, что можно любить (нечего любить).\n" +
            "There is no time to lose. – Нет (лишнего) времени, которое можно потерять. \n" +
            "There is no time to be lost. – Нет (лишнего) времени, которое можно потерять.\n" +
            "Функции инфинитива\n" +
            "Инфинитив в предложении может выполнять различные функции: быть подлежащим, дополнением, частью составного сказуемого, определением и др.\n" +
            "\n" +
            "Подлежащее (главный член предложения)\n" +
            "To love and to be loved is the biggest happiness. – Любить и быть любимым – самое большое счастье.\n" +
            "Дополнение (второстепенный член предложения)\n" +
            "Chris asked me to help him with his homework. – Крис попросил меня помочь ему с домашним заданием.\n" +
            "Часть составного сказуемого \n" +
            "The work will have been finished by 4p.m. tomorrow. – Работа будет окончена к 4 часам вечера завтра. \n" +
            "Определение (признак, качество, свойство предмета)\n" +
            "I have my children to look after. – У меня есть дети, о которых я должен заботиться.\n" +
            "Инфинитив часто используется в предложениях в качестве вводных слов или фраз.\n" +
            "\n" +
            "To put it mildly, Jack was tipsy. – Мягко выражаясь, Джек был подвыпивший.\n" +
            "To tell the truth, I don’t really like this city. – Честно говоря, я очень не люблю этот город.\n" +
            "Well, to cut a long story short, the party was awful. – Короче говоря, вечеринка была ужасная.\n" +
            "Полный инфинитив\n" +
            "Полный инфинитив (to-infinitive) – это инфинитив, который используется с частицей to. Полный инфинитив используется для выражения цели или намерения действия.\n" +
            "\n" +
            "I go shopping to buy some food for my party. – Я иду по магазинам, чтобы купить еды для моей вечеринки.\n" +
            "I told my mom about my grades to be praised. – Я рассказал маме о своих оценках, чтобы она меня похвалила.\n" +
            "Инфинитив с to в сочетании со словом only (только) указывает на неожиданное происшествие, поворот событий.\n" +
            "\n" +
            "I arrived here only to find out that the party is already over! – Я приехал сюда только ради того, чтобы узнать, что вечеринка уже кончилась!\n" +
            "Инфинитив с to всегда используется после следующих глаголов.\n" +
            "\n" +
            "to agree – соглашаться\n" +
            "to aim – намереваться, пытаться\n" +
            "to appear – оказаться\n" +
            "to arrange – договариваться\n" +
            "to ask – просить\n" +
            "to attempt – попытаться\n" +
            "to be able – быть в состоянии, мочь\n" +
            "to beg – просить, умолять\n" +
            "to begin – начинать\n" +
            "to care – хотеть, иметь желание\n" +
            "to choose – выбирать\n" +
            "to claim – заявлять, утверждать\n" +
            "to dare – решаться, иметь смелость\n" +
            "to decide – решить\n" +
            "to demand – требовать\n" +
            "to deserve – заслуживать\n" +
            "to dread – бояться, страшиться\n" +
            "to expect – ожидать\n" +
            "to fail – не сбываться, не сделать, не смочь\n" +
            "to get – получить разрешение\n" +
            "to happen – оказаться, случатся\n" +
            "to hesitate – не решаться\n" +
            "to hope – надеяться\n" +
            "to hurry – поспешить\n" +
            "to intend – намереваться\n" +
            "to learn – учиться\n" +
            "to manage – смочь, справляться\n" +
            "to need – нуждаться\n" +
            "to neglect – забывать, не сделать чего-то\n" +
            "to plan – планировать\n" +
            "to prepare – приготовиться\n" +
            "to pretend – делать вид, притворяться\n" +
            "to proceed – перейти к, начать делать что-то после чего-то\n" +
            "to promise – обещать\n" +
            "to refuse – отказываться\n" +
            "to seem – казаться\n" +
            "to strive – пытаться, прилагать усилия\n" +
            "to swear – клясться\n" +
            "to tend – иметь склонность, тяготеть\n" +
            "to threaten – угрожать, запугивать\n" +
            "to vow – давать клятву\n" +
            "to wait – ждать\n" +
            "to want – хотеть\n" +
            "to wish – хотеть, желать\n" +
            "My children refuse to drink milk. – Мои дети отказываются пить молоко.\n" +
            "Kate wanted to enter her flat but she forgot her keys. – Кейт хотела войти в свою квартиру, но забыла ключи. \n" +
            "I agree to come with you if you promise to take me back home after. – Я согласна пойти с тобой, если ты мне обещаешь, что отвезешь меня домой после.\n" +
            "Инфинитив с to используется после глаголов to ask (спросить), to learn (научиться, узнать), to explain (объяснять), to decide (решить), to find out (узнать), to want to know (хотеть узнать), когда после них стоит вопросительное слово.\n" +
            "\n" +
            "I learned how to swim when I was 5. – Я научилась плавать, когда мне было 5 лет.\n" +
            "We should decide now what to do next. – Мы должны решить, что нам делать дальше.\n" +
            "Ralph wanted to know where to buy some good cheese. – Ральф хотел узнать, где можно купить хороший сыр.\n" +
            "Инфинитив с to используется после выражений would like или would love (хотел бы), would prefer (предпочел бы), которые указывают на определенное желание.\n" +
            "\n" +
            "I would like to talk to Mr. James. – Я бы хотел поговорить с мистером Джеймсом.\n" +
            "We would love to play with you, but we have no time. – Мы бы с радостью с тобой поиграли, но у нас нет времени.\n" +
            "I would prefer to drink something hot. It’s cold outside. – Я бы предпочел выпить что-нибудь горячее. На улице холодно.\n" +
            "Инфинитив с to используется с конструкциями в пассивном залоге to be made (быть заставленным), to be seen (быть увиденным), to be heard (быть услышанным) и to be known в значении «быть увиденным», «быть замеченным». Когда эти глаголы используются в активном залоге, после них ставится голый инфинитив.\n" +
            "\n" +
            "Jessica was made to take a blood test. – Джессику заставили сделать тест на кровь.\n" +
            "We don’t like to be seen to cuddle. – Мы не любим, когда кто-то видит, как мы обнимаемся.\n" +
            "I was heard to be playing the guitar. – Кто-то услышал, как я играл на гитаре.\n" +
            "He was never known to do something good. – Никто никогда не видел, чтобы он сделал что-нибудь хорошее.\n" +
            "Инфинитив с to используется после прилагательных, которые указывают на эмоции, чувства или связаны с характером человека, его качествами. Часто такие предложения начинаются выражением it is.\n" +
            "\n" +
            "I was pretty lucky to get this job. – Мне очень посчастливилось получить эту работу.\n" +
            "James was reluctant to agree to their offer. – Джеймсу не хотелось соглашаться на их предложение.\n" +
            "It was very stupid of you not to wear a hat when it’s -20 outside. – Это было очень глупо с твоей стороны не надеть шапку, когда на улице -20.\n" +
            "Инфинитив с to всегда используется после слов too (слишком) и enough (достаточно).\n" +
            "\n" +
            "It’s too cold outside to go jogging. – На улице слишком холодно, чтобы пойти на пробежку.\n" +
            "That restaurant was good enough to visit it. – Тот ресторан был достаточно неплохим, чтобы туда сходить.\n" +
            "Инфинитив с to всегда используется после слов first (первый), second (второй), next (следующий), last (последний).\n" +
            "\n" +
            "Yuri Gagarin was the first man to enter outer space. – Юрий Гагарин был первым человеком, который вышел в открытый космос.\n" +
            "Jack is the last to sign this petition. – Джек – последний, кто подпишет эту петицию.\n" +
            "Инфинитив с to используется в вводных словах и некоторых выражениях.\n" +
            "\n" +
            "to be honest – честно говоря\n" +
            "to begin with – для начала\n" +
            "to cut a long story short – короче говоря\n" +
            "to put it mildly – мягко говоря\n" +
            "to sum up – в заключение\n" +
            "to tell the truth – по правде говоря\n" +
            "To be honest, you were unfair. – Честно говоря, ты был несправедлив.\n" +
            "To sum up, I would like to quote one famous scientist. – В заключение я бы хотел процитировать одного известного ученого.\n" +
            "Голый инфинитив\n" +
            "Голый инфинитив (Bare Infinitive или Zero Infinitive) – это инфинитив без частицы to. \n" +
            "\n" +
            "Инфинитив без to используется после вспомогательных глаголов\n" +
            "\n" +
            "Shall we dance? – Потанцуем?\n" +
            "I don’t understand this text. – Я не понимаю этот текст.\n" +
            "They will have finished their project by the next Thursday. – Они закончат свой проект к следующему четвергу.\n" +
            "Инфинитив без to используется после модальных глаголов, кроме глагола ought (ought to) и модальной конструкции have to. Однако, глаголы dare (сметь) и need (нуждаться) в качестве смысловых глаголов, а не модальных, используются с глаголами с частицей to.\n" +
            "\n" +
            "You shall not pass! – Ты не пройдешь!\n" +
            "Matthew can run really fast! – Мэтью может бегать действительно быстро!\n" +
            "You should have helped that old lady. – Тебе следовало бы помочь той пожилой леди.\n" +
            "Инфинитив без to используется после глаголов, которые выражают восприятия, ощущения: to hear (слышать), to feel (чувствовать), to see (видеть), to watch (смотреть, наблюдать). Однако после to feel глагол to be всегда используется с частицей to. \n" +
            "\n" +
            "I heard him fall from the stairs. – Я слышал, как он упал с лестницы.\n" +
            "He felt his heart jump when he saw her. – Он почувствовал, что у него ёкнуло сердце, когда он ее увидел.\n" +
            "I have never seen you dance before. – Я никогда прежде не видел, как ты танцуешь.\n" +
            "She felt this information to be true. - Она чувствовала, что эта информация верна.\n" +
            "Инфинитив без to используется после глаголов to let (разрешать, давать право), to make в значении «заставлять», to have в значении «заставлять, велеть, допускать», to bid в значении «предлагать, приглашать». После глагола to help (помогать) может использоваться глагол как с частицей to, так и без нее.\n" +
            "\n" +
            "Let me rest a bit. – Дай мне немного отдохнуть.\n" +
            "My mom made me cook yesterday. – Моя мама заставила меня готовить вчера.\n" +
            "Paul had the porters take his luggage. – Пол велел носильщикам взять его багаж.\n" +
            "I helped Ralph (to) write this article. – Я помог Ральфу написать эту статью.\n" +
            "Инфинитив без to используется после выражений had better (лучше бы), would rather (предпочтительней), would sooner (скорее), cannot but (не могу не), nothing but (ничего, кроме), cannot choose but (ничего не остается делать, как), а также предлогов except (за исключением), but (но, кроме), save (кроме) и than (чем).\n" +
            "\n" +
            "I cannot but laugh. – Я не могу не смеяться.\n" +
            "He did nothing today except sleep. – Он ничего сегодня не делал кроме как спать.\n" +
            "You had better go to bed now than play computer games. – Тебе бы лучше лечь спать, чем играть в компьютерные игры.\n" +
            "Инфинитив без to используется в предложениях, начинающихся с вопросительной фразы why not (почему бы не).\n" +
            "\n" +
            "Why not dance? – Почему бы не потанцевать?\n" +
            "Why not come to us and have some drinks? – Почему бы не пойти к нам и не выпить чего-нибудь?\n\n\n\n";

    static String gerund = "Неопределенный герундий\n" +
            "Неопределенный герундий (Indefinite Gerund) – это герундий в неопределенном аспекте. Он имеет формы активного и пассивного залогов. Неопределенный герундий выражает действие, которое происходит одновременно с другим действием, выраженным глаголом-сказуемым в личной форме. В этом случае время действия определяется по глаголу в личной форме.\n" +
            "\n" +
            "Активный залог\n" +
            "Excuse me for disturbing you. – Простите, что мешаю вам. (дословно: простите за мое вмешательство)\n" +
            "He won’t mind your coming. – Он не будет против, если ты придешь. (дословно: он не будет против твоего прихода)\n" +
            "Пассивный залог\n" +
            "He entered the house without being seen. – Он вошел в дом незамеченным.\n" +
            "Being eaten by aboriginals was not something Cook was dreaming about. – Быть съеденным аборигенами не было тем, о чем мечтал Кук.\n" +
            "Герундий активного залога обычно употребляется после глаголов to want (хотеть), to need (нуждаться), to deserve (заслуживать), to require (требовать) и прилагательного worth (стоящий), даже если в предложении подразумевается действие пассивного залога. \n" +
            "\n" +
            "His house wants repairing. – Его дом нужно отремонтировать. (дословно: его дом нуждается в ремонте)\n" +
            "Our children deserve praising. – Наши дети заслуживают похвалы.\n" +
            "This play was worth seeing. – Этот спектакль стоил того, чтобы его посмотреть.\n" +
            "Совершенный герундий\n" +
            "Совершенный герундий (Perfect Gerund) – это герундий в совершенном аспекте. Имеет также формы активного и пассивного залогов. Совершенный герундий выражает действие, которое произошло до другого действия, выраженного глаголом-сказуемым. Совершенный герундий на русский язык переводится придаточным предложением.\n" +
            "\n" +
            "Активный залог\n" +
            "Clark denies having done it. – Кларк отрицает, что сделал это.\n" +
            "I was ashamed of having talked to my teacher rudely. – Мне было стыдно из-за того, что я так грубо разговаривал с учителем.\n" +
            "Пассивный залог\n" +
            "She was angry at having been cheated so easily. – Она была злая от того, что ее так просто обманули.\n" +
            "Ann denied having been married to John. – Энн отрицала, что была замужем за Джоном.\n" +
            "Функции герундия\n" +
            "Герундий в предложении может выступать в качестве подлежащего, дополнения или именной части составного сказуемого, так как он может выполнять те же функции, что и существительное.\n" +
            "\n" +
            "Подлежащее (главный член предложения)\n" +
            "Smoking can destroy your health. – Курение может уничтожить твое здоровье. \n" +
            "Дополнение (второстепенный член предложения)\n" +
            "Jane likes making people happy. – Джейн любит дарить людям счастье. \n" +
            "Именная часть составного сказуемого (главный член предложения)\n" +
            "Our duty is taking care of those, who need help. – Наш долг – это забота о тех, кому нужна помощь. \n" +
            "Употребление герундия\n" +
            "Герундий всегда употребляется после следующих простых и фразовых глаголов.\n" +
            "\n" +
            "to admit– признавать\n" +
            "to appreciate – ценить, быть признательным\n" +
            "to avoid – избегать\n" +
            "to burst out – начинать, вспыхивать\n" +
            "to consider – рассматривать, считать\n" +
            "to continue – продолжать\n" +
            "to go on – продолжать\n" +
            "to imagine – представлять\n" +
            "to keep (on) – продолжать\n" +
            "to leave off – переставать\n" +
            "to mind – возражать (в отрицании и вопросах)\n" +
            "to miss – скучать\n" +
            "to deny – отрицать\n" +
            "to excuse – извинять\n" +
            "to fancy – воображать (в восклицательных предложениях)\n" +
            "to finish – заканчивать\n" +
            "to forgive – прощать\n" +
            "to give up – сдаваться\n" +
            "to go – заниматься (спортом)\n" +
            "to postpone – откладывать\n" +
            "to practice – практиковать\n" +
            "to prevent – предотвращать\n" +
            "to put off – откладывать\n" +
            "to quit – прекращать, бросать\n" +
            "to save – сохранять\n" +
            "to suggest – предлагать\n" +
            "Fancy meeting you here! – Не мог даже представить, что встречу тебя тут!\n" +
            "Relax. Imagine lying on the beach and drinking cocktails. – Расслабься. Представь себе, что ты лежишь на пляже и попиваешь коктейли.\n" +
            "Герундий употребляется после глаголов, когда они указывают на чьи-то общие предпочтения, часто после to love (любить), to like (нравится), to enjoy (наслаждаться), to prefer (предпочитать), to dislike (не любить), to hate (ненавидеть)\n" +
            "\n" +
            "She hates cooking. – Она ненавидит готовить.\n" +
            "I don’t like writing letters. – Я не люблю писать письма.\n" +
            "Kate enjoys watching football with her boyfriend. – Кэйт нравится смотреть футбол с ее парнем.\n" +
            "Герундий употребляется после глаголов to spend (тратить), to waste (тратить напрасно), to lose (терять), когда они подразумевают напрасную трату денег, времени, здоровья и др.\n" +
            "\n" +
            "She lost her health taking care of children. – Она подорвала свое здоровье, ухаживая за детьми.\n" +
            "Matt spent a lot of money buying a computer he doesn’t even use. – Мэтт потратил много денег на компьютер, которым он даже не пользуется.\n" +
            "Форма герундия употребляется с глаголами to hear (слышать), to listen to (слушать), to notice (замечать), to see (видеть), to watch (смотреть), to feel (чувствовать), когда они указывают на действие, которое не было завершено до конца.\n" +
            "\n" +
            "I watched the actors rehearsing the play. – Я смотрел, как актеры репетировали спектакль. (я видел только часть репетиции)\n" +
            "Ann heard some guys talking about her. – Энн слышала, как какие-то парни говорили о ней. (она слышала только часть разговора) \n" +
            "Герундий употребляется после глаголов и выражений с предлогами, которые перечислены ниже. \n" +
            "\n" +
            "cannot help – не мочь остановиться\n" +
            "cannot stand – не терпеть\n" +
            "not to like the idea of – не любить затею\n" +
            "to accuse of – винить\n" +
            "to agree to – соглашаться\n" +
            "to approve of – одобрять\n" +
            "to be astonished at – быть пораженным, удивленным\n" +
            "to be aware of – знать, быть в курсе\n" +
            "to be busy in – быть занятым\n" +
            "to be capable of – быть способным на\n" +
            "to be displeased at – быть недовольным\n" +
            "to be fond of – любить\n" +
            "to be guilty of – быть виновным\n" +
            "to be indignant at – возмущаться\n" +
            "to be pleased at – быть довольным\n" +
            "to be proud of – гордиться\n" +
            "to be sure of – быть уверенным в\n" +
            "to be surprised at – быть удивленным\n" +
            "to be used to – быть привычным к\n" +
            "to be worth – быть достойным\n" +
            "to complain of – жаловаться\n" +
            "to depend on – зависеть\n" +
            "to feel like – хотеть\n" +
            "to give up the idea of – отказаться от идеи\n" +
            "to have difficulty in – иметь трудности с\n" +
            "to have trouble – иметь трудности с\n" +
            "to insist on – настаивать\n" +
            "to look forward to – ждать с нетерпением\n" +
            "to look like – похоже, собираться\n" +
            "to miss an opportunity of – потерять возможность\n" +
            "to object to – возражать\n" +
            "to persist in – упорствовать\n" +
            "to prevent from – уберечь\n" +
            "to rely on – положиться\n" +
            "to speak of – высказываться\n" +
            "to succeed in – преуспеть\n" +
            "to suspect of – подозревать\n" +
            "to thank for – благодарить\n" +
            "to think of – думать, собираться\n" +
            "It looks like raining. – Похоже, собирается на дождь.\n" +
            "I was thinking of inviting Paul to my party. – Я думал над тем, чтобы пригласить Пола на свою вечеринку.\n" +
            "Герундий употребляется в устойчивых выражениях.\n" +
            "\n" +
            "it is no use ... – нет смысла, нужды в ...\n" +
            "it is (no) good ... – нехорошо (хорошо) ...\n" +
            "what is the use of ..? – в чем нужда в ..? \n" +
            "there is no point in ... – нет смысла в ...\n" +
            "in addition to ... – в дополнение...\n" +
            "In addition to cleaning and washing, i had to cook as well. – Вдобавок к уборке и стирке, я должна была еще и готовить.\n" +
            "What is the use of going to that party? We can hang out here. – Какой смысл в том, чтобы идти на ту вечеринку? Мы можем потусить тут.\u200B\n" +
            "Герундий или инфинитив?\n" +
            "После некоторых глаголов могут использоваться как герундий, так и полный инфинитив, однако значение таких предложений несколько отличается.\n" +
            "\n" +
            "Forget + инфинитив с to – забыть сделать что-то.\n" +
            "Forget + герундий – забывать какой-либо момент из жизни, не хранить воспоминание.\n" +
            "\n" +
            "I forgot to bring my books today. – Я забыл взять с собой книги сегодня.\n" +
            "I will never forget swimming in the ocean! – Я никогда не забуду, как купалась в океане!\n" +
            "Remember + инфинитив с to – помнить, что надо что-то сделать.\n" +
            "Remember + герундий – помнить момент из жизни, хранить воспоминание о чем-то.\n" +
            "\n" +
            "Do you remember to take your pills? – Ты помнишь, что тебе надо принять таблетки?\n" +
            "I remember visiting Paris with my friends. – Я помню, как мы ездили с друзьями в Париж.\n" +
            "Mean + инфинитив с to – намереваться, собираться.\n" +
            "Mean + герундий – означать, значить, предвещать.\n" +
            "\n" +
            "I meant to call you yesterday, but I forgot. – Я собирался позвонить тебе вчера, но забыл.\n" +
            "If I accept this job offer, it will mean working long hours. – Если я приму это предложение работы, это будет означать, что у меня будет удлиненный рабочий день.\n" +
            "Regret + инфинитив с to – чувствовать сожаление, досаду (по отношению к другим людям).\n" +
            "Regret + герундий – раскаиваться, сожалеть о сделанном, что-то сделано зря.\n" +
            "\n" +
            "We regret to inform you that you have failed the test. – С огорчением сообщаем вам, что вы не сдали экзамен.\n" +
            "I regret buying this expensive dress. It doesn’t suit me. – Я жалею, что купила это дорогое платье. Оно мне не идет.\n" +
            "Try + инфинитив с to – пытаться, стараться изо всех сил.\n" +
            "Try + герундий –  попробовать сделать что-то в качестве эксперимента.\n" +
            "\n" +
            "Ann tried to persuade him but she failed. – Энн пыталась убедить его, но у нее не получилось.\n" +
            "I tried colouring my hair in red and I liked it. – Я попробовала покрасить волосы в красный и мне понравился результат.\n" +
            "Stop + инфинитив с to – остановиться, чтобы сделать что-либо.\n" +
            "Stop + герундий – прекратить делать что-то.\n" +
            "\n" +
            "We stopped to buy some food. – Мы остановились, чтобы купить что-нибудь поесть.\n" +
            "You should stop buying useless things. – Ты должен прекратить покупать ненужные вещи.\n\n\n\n";

    static String inVerbs = "Неправильные глаголы английского языка отличаются от правильных глаголов тем, что имеют свои особые формы для Past Simple (простого прошедшего времени) и Past Participle (причастия прошедшего времени). \n" +
            "\n" +
            "Несмотря на то, что эти глаголы называются неправильными или глаголами-исключениями, в английском языке их достаточно много. Большинство из них - исконно английские глаголы, которые употреблялись в древнеанглийском языке. Древнеанглийский язык считался довольно сложным языком, так как cуществовало несколько различных правил спряжения глаголов и изменения их форм в определенных грамматических временах. То есть все неправильные глаголы современного английского раньше были правильными. Со временем английский язык упростился, а с ним упростились и способы образования форм глаголов. Таким образом, общеупотребимым способом образования прошедшего времени (а также причастия прошедшего времени) стало добавление окончания -ed к основе глагола. Тем не менее, некоторые глаголы не поддались на языковые изменения и сохранили свои старые формы спряжения даже в современном английском. Именно поэтому их и начали называть неправильными глаголами английского языка.\n" +
            "\n" +
            "Не существует единого правила для образования форм неправильных глаголов, поэтому их формы стоит заучивать наизусть. \n" +
            "\n" +
            "Некоторые глаголы могут использоваться в качестве как правильных, так и неправильных глаголов, поэтому для таких глаголов в таблице первой указана наиболее распространенная форма.  Также некоторые глаголы имеют различные формы в зависимости от значения, в котором они используются. \n" +
            "\n" +
            "Поиск по таблице\n" +
            "TOP\tINFINITIVE\tPAST SIMPLE\tPAST PARTICIPLE\tПЕРЕВОД\n" +
            "A\n" +
            "abide\tabode / abided\tabode / abided\tтерпеть, выносить; придерживаться чего-либо, быть верным\n" +
            "arise\tarose\tarisen\tвозникать, подниматься\n" +
            "awake\tawaked / awoke\tawaked / awoken\t\n" +
            "будить,  вызывать, просыпаться, понимать\n" +
            "\n" +
            "\n" +
            "B\n" +
            "backslide\tbackslid\tbackslidden / backslid\tотступаться от веры, снова предаваться пороку\n" +
            "be\twas, were\tbeen\tбыть, являться\n" +
            "bear\tbore / beared\tborn / borne / beared\t\n" +
            "нести, выносить, держать, питать чувство\n" +
            "\n" +
            "\n" +
            "beat\tbeat\tbeaten / beat\t\n" +
            "бить, побеждать\n" +
            "\n" +
            "\n" +
            "become\tbecame\tbecome\tстановиться, делаться\n" +
            "befall\tbefell\tbefallen\tслучаться, приключаться\n" +
            "begin\tbegan\tbegun\tначинать\n" +
            "behold\tbeheld\tbeheld\tувидеть, заметить, созерцать, наблюдать\n" +
            "bend\tbent\tbent\tгнуть, сгибать\n" +
            "bereave\tbereft / bereaved\tbereft / bereaved\tлишать, отнимать, отбирать\n" +
            "beseech\tbesought/beseeched\tbesought/beseeched\tумолять, просить, упрашивать\n" +
            "beset\tbeset \tbeset \tокружать, осаждать, преграждать\n" +
            "bet\tbet / betted \tbet / betted \t\n" +
            "держать пари, быть уверенным\n" +
            "\n" +
            "\n" +
            "bid\tbid / bade\tbidden\tприглашать, приветствовать, прощаться\n" +
            "bid\tbid\tbid\tпредлагать цену, велеть, просить\n" +
            "bide\tbode / bided\tbided\tждать, выжидать, оставаться, находиться\n" +
            "bind\tbound\tbound\tсвязывать\n" +
            "bite\tbit\tbitten\tкусать, клевать, жалить\n" +
            "bleed\tbled\tbled\tкровоточить, истекать кровью\n" +
            "bless\tblessed / blest\tblessed / blest\tблагословлять, одаривать, перекрестить\n" +
            "blow\tblew\tblown\tдуть, веять, задувать, выдувать, взрывать\n" +
            "break\tbroke\tbroken\tломать, прерывать, разбивать\n" +
            "breed\tbred\tbred\tвыводить, вскармливать, размножаться, порождать\n" +
            "bring\tbrought\tbrought\tприносить, приводить, доводить\n" +
            "broadcast\tbroadcast / broadcasted\tbroadcast / broadcasted\tвещать, распространять, передавать по радио\n" +
            "build\tbuilt\tbuilt\tстроить, сооружать\n" +
            "burn\tburned / burnt\tburned / burnt\t\n" +
            "гореть, сжигать\n" +
            "\n" +
            "\n" +
            "burst\tburst\tburst\tлопаться, взрываться, быть переполненным, появиться\n" +
            "bust\tbusted / bust\tbusted / bust\tсломать, разрушать, разориться, бить\n" +
            "buy\tbought\tbought\tпокупать\n" +
            "C\n" +
            "cast\tcast\tcast\tбросать, отбрасывать, уволить, отливать (метал)\n" +
            "catch\tcaught\tcaught\tпоймать, ловить, догнать\n" +
            "chide\tchided / chid\tchided / chid / chidden\tраспекать, ругать, бранить, реветь\n" +
            "choose\tchose\tchosen\tвыбирать\n" +
            "cleave\tcleft / clove\tcleft / cloven \tраскалывать, рассекать\n" +
            "cling\tclung\tclung\tцепляться, держаться, липнуть\n" +
            "clothe\tclothed / clad\tclothed / clad\t\n" +
            "одеть, одевать, выражать, одарять\n" +
            "\n" +
            "\n" +
            "come\tcame\tcome\tприходить\n" +
            "cost\tcost\tcost\tоценивать, стоить\n" +
            "creep\tcrept\tcrept\tползать, красться, охватывать, наводить ужас\n" +
            "crossbreed\tcrossbred\tcrossbred\tскрещивать\n" +
            "cut\tcut\tcut\tрезать, обрезать\n" +
            "D\n" +
            "dare\tdurst \tdared \tсметь, бросать вызов, рисковать\n" +
            "daydream\tdaydreamed / daydreamt\tdaydreamed / daydreamt\t\n" +
            "грезить наяву, мечтать, фантазировать\n" +
            "\n" +
            "\n" +
            "deal\tdealt\tdealt\tиметь дело, торговать, рассматривать вопрос\n" +
            "dig\tdug\tdug\tкопать, рыть, искать\n" +
            "disprove\tdisproved\tdisproved / disproven\tопровергать, доказывать ложность\n" +
            "dive\tdove / dived\tdived\tнырять, прыгать вниз, окунаться\n" +
            "do\tdid\tdone\tделать, выполнять\n" +
            "draw\tdrew\tdrawn\tчертить, рисовать, представлять; тащить, тянуть \n" +
            "dream\tdreamed / dreamt\tdreamed / dreamt\t\n" +
            "видеть сны, мечтать\n" +
            "\n" +
            "\n" +
            "drink\tdrank\tdrunk\tпить, выпивать\n" +
            "drive\tdrove\tdriven\tводить (машину), управлять, ездить\n" +
            "dwell\tdwelt / dwelled\tdwelt / dwelled\t\n" +
            "жить, обитать, пребывать, останавливаться\n" +
            "\n" +
            "\n" +
            "E\n" +
            "eat\tate\teaten\tесть, принимать пищу, кушать\n" +
            "F\n" +
            "fall\tfell\tfallen\tпадать, опадать, опускаться\n" +
            "feed\tfed\tfed\tкормить\n" +
            "feel\tfelt\tfelt\tчувствовать\n" +
            "fight\tfought\tfought\tбороться, сражаться\n" +
            "find\tfound\tfound\tнаходить, обнаруживать\n" +
            "fit\tfitted / fit\tfitted / fit\t\n" +
            "подгонять, прилаживать, приспосабливать, оснащать\n" +
            "\n" +
            "\n" +
            "flee\tfled\tfled\tбежать, спасаться бегством\n" +
            "fling\tflung\tflung\tкидать, бросать\n" +
            "fly\tflew\tflown\tлетать, пролетать\n" +
            "forbear\tforbore\tforborne\tсдерживаться, воздерживаться, быть выдержанным\n" +
            "forbid\tforbade\tforbidden\tзапрещать\n" +
            "forecast\tforecast\tforecast\tпрогнозировать, предсказывать\n" +
            "forego\tforewent\tforegone\tпредшествовать, идти впереди\n" +
            "foresee\tforesaw\tforeseen\tпредвидеть, предугадывать\n" +
            "foretell\tforetold\tforetold\tпредсказывать, прогнозировать\n" +
            "forget\tforgot\tforgotten / forgot\t\n" +
            "забывать\n" +
            "\n" +
            "\n" +
            "forgive\tforgave\tforgiven\tпрощать, забыть (долг)\n" +
            "forgo\tforwent \tforgone \tотказываться, воздерживаться\n" +
            "forsake\tforsook\tforsaken\tбросать, оставлять, отказываться\n" +
            "forswear\tforswore\tforsworn\tотказываться, отрекаться\n" +
            "freeze\tfroze\tfrozen\tзамерзать, замораживать\n" +
            "frostbite\tfrostbit\tfrostbitten\tобморозить, отморозить\n" +
            "G\n" +
            "get\tgot\tgotten / got\t\n" +
            "получать, становиться\n" +
            "\n" +
            "\n" +
            "gild\tgilded / gilt\tgilded / gilt\tзолотить, покрывать позолотой, украшать\n" +
            "give\tgave\tgiven\tдавать\n" +
            "go\twent\tgone\tидти, ехать\n" +
            "grind\tground\tground\tмолоть, растереть, шлифовать, точить\n" +
            "grow\tgrew\tgrown\tрасти, выращивать\n" +
            "H\n" +
            "hand-feed\thand-fed\thand-fed\tподавать вручную\n" +
            "handwrite\thandwrote\thandwritten\tписать вручную\n" +
            "hang\thung\thung\tвисеть, вешать\n" +
            "have\thad\thad\tиметь, обладать\n" +
            "hear\theard\theard\tслышать, слушать\n" +
            "heave\theaved / hove\theaved / hove\t\n" +
            "поднимать, перемещать, вздыматься, напрягаться\n" +
            "\n" +
            "\n" +
            "hew\thewed\thewn / hewed\tрубить, тесать, отбывать, согласовываться\n" +
            "hide\thid\thidden\tпрятать, прятаться\n" +
            "hit\thit\thit\tударять, поражать\n" +
            "hold\theld\theld\tзанимать, держать, удерживать\n" +
            "hurt\thurt\thurt\tповредить, причинять боль, ранить\n" +
            "I\n" +
            "inbreed\tinbred\tinbred\tвзращивать, воспитывать что-то в ком-то\n" +
            "inlay\tinlaid\tinlaid\tинкрустировать, делать вставку\n" +
            "input\tinput / inputted\tinput / inputted\tввести, вводить, вкладывать (деньги)\n" +
            "interbreed\tinterbred\tinterbred\tскрещивать, скрещиваться\n" +
            "interweave\tinterwove / interweaved\tinterwoven / interweaved\tcплетать, переплетать, смешивать, воткать\n" +
            "interwind\tinterwound\tinterwound\tпереплетать, перематывать\n" +
            "J\n" +
            "jerry-build\tjerry-built\tjerry-built\tпостроить на скорую руку, кое-как\n" +
            "K\n" +
            "keep\tkept\tkept\tдержать, сохранять, хранить\n" +
            "kneel\tknelt / kneeled\tknelt / kneeled\tстановиться на колени\n" +
            "knit\tknitted / knit\tknitted / knit\tвязать, штопать\n" +
            "know\tknew\tknown\tзнать, уметь, быть знакомым\n" +
            "L\n" +
            "lay\tlaid\tlaid\tкласть, валить, накрывать\n" +
            "lead\tled\tled\tвести, сопровождать\n" +
            "lean\tleaned / leant \tleaned / leant \t\n" +
            "опираться, наклоняться, прислоняться\n" +
            "\n" +
            "\n" +
            "leap\tleaped / leapt\tleaped / leapt\t\n" +
            "прыгать, скакать\n" +
            "\n" +
            "\n" +
            "learn\tlearned / learnt\tlearned / learnt\t\n" +
            "учиться, узнавать\n" +
            "\n" +
            "\n" +
            "leave\tleft\tleft\tоставлять, уезжать\n" +
            "lend\tlent\tlent\tодалживать, давать взаймы, занимать\n" +
            "let\tlet\tlet\tпозволять, допускать, выпускать, проливать\n" +
            "lie\tlay\tlain\t\n" +
            "лежать, распологаться, находиться\n" +
            "\n" +
            "\n" +
            "light\tlit / lighted\tlit / lighted\tнатолкнуться, обрушиться, освещать, зажигать, светиться\n" +
            "lip-read\tlip-read\tlip-read\tчитать с губ, понимать по губам\n" +
            "lose\tlost\tlost\tтерять, утрачивать, избавляться, пропадать\n" +
            "M\n" +
            "make\tmade\tmade\tделать, производить, совершать\n" +
            "mean\tmeant\tmeant\tзначить, подразумевать\n" +
            "meet\tmet\tmet\tвстречать, знакомиться\n" +
            "miscast\tmiscast\tmiscast\tнеправильно распределять роли\n" +
            "misdeal\tmisdealt\tmisdealt\tошибаться при сдаче\n" +
            "misdo\tmisdid\tmisdone\tделать неправильно, небрежно\n" +
            "mishear\tmisheard\tmisheard\tослышаться, не расслышать\n" +
            "mislay\tmislaid\tmislaid\tположить не на место, затерять\n" +
            "mislead\tmisled\tmisled\tвводить в заблуждение, сбивать с пути\n" +
            "mislearn\tmislearned / mislearnt\tmislearned / mislearnt\t\n" +
            "обучаться, учить неправильно\n" +
            "\n" +
            "\n" +
            "misread\tmisread\tmisread\tпрочитать неправильно, неправильно понять\n" +
            "missay\tmissaid\tmissaid\tоговориться, сказать неправильно\n" +
            "misset\tmisset\tmisset\tнеправильно установить\n" +
            "misspeak\tmisspoke\tmisspoken\tговорить, произносить неправильно\n" +
            "misspell\tmisspelled / misspelt\tmisspelled / misspelt\t\n" +
            "писать с ошибками, делать орфографические ошибки\n" +
            "\n" +
            "\n" +
            "misspend\tmisspent\tmisspent\tнеразумно тратить, транжирить\n" +
            "misswear\tmisswore\tmissworn\tдавать ложную клятву\n" +
            "mistake\tmistook\tmistaken\tошибаться, заблуждаться\n" +
            "misteach\tmistaught\tmistaught\tнеправильно обучать\n" +
            "misunderstand\tmisunderstood\tmisunderstood\tне понимать, понять неправильно\n" +
            "miswrite\tmiswrote\tmiswritten\tнеправильно писать\n" +
            "mow\tmowed\tmowed / mown\tкосить, стричь (газон), жать\n" +
            "O\n" +
            "offset\toffset\toffset\tвозмещать, компенсировать, ответвляться\n" +
            "outbid\toutbid\toutbid\tперебивать цену, превзойти, затмить\n" +
            "outdo\toutdid\toutdone\tпревзойти, поражать, побороть\n" +
            "outdraw\toutdrew\toutdrawn\tдобиться большей популярности, превзойти конкурентов\n" +
            "outdrink\toutdrank\toutdrunk\tперепить (кого-то), выпить больше, чем кто-то\n" +
            "outdrive\toutdrove\toutdriven\tобогнать, опередить\n" +
            "outfight\toutfought\toutfought\tиметь перевес над противником, побеждать\n" +
            "outfly\toutflew\toutflown\tвылетать, летать быстрее, дальше (чем кто-либо)\n" +
            "outgrow\toutgrew\toutgrown\tопережать в росте, перерастать, избавляться с возрастом\n" +
            "outleap\toutleaped / outleapt\toutleaped / outleapt\t\n" +
            "перепрыгивать, выпрыгивать, прыгать лучше\n" +
            "\n" +
            "\n" +
            "outlie\toutlay\toutlain\t\n" +
            "находиться снаружи, вне, простираться\n" +
            "\n" +
            "\n" +
            "outrun\toutran\toutrun\tперегонять, опережать, убежать, сбежать\n" +
            "outsell\toutsold\toutsold\tпродавать, продаваться лучше, превосходить в цене\n" +
            "outshine\toutshined / outshone\toutshined / outshone\t\n" +
            "затмить\n" +
            "\n" +
            "\n" +
            "outshoot\toutshot\toutshot\tстрелять лучше, отбрасывать, выбрасывать\n" +
            "outsing\toutsang\toutsung\tпревзойти в пении\n" +
            "outsit\toutsat\toutsat\tпересидеть, засидеться\n" +
            "outsleep\toutslept\toutslept\tпроспать, прозевать\n" +
            "outsmell\toutsmelled / outsmelt\toutsmelled / outsmelt\t\n" +
            "пахнуть сильнее, чем что-то\n" +
            "\n" +
            "\n" +
            "outspeak\toutspoke\toutspoken\tговорить лучше, высказаться, заявить\n" +
            "outspeed\toutsped / outspeeded\toutsped / outspeeded\tперегонять, быть, действовать быстрее\n" +
            "outspend\toutspent\toutspent\tпревзойти по расходам, тратить больше\n" +
            "outstand\toutstood\toutstood\tвыделяться, бросаться в глаза, выдержать\n" +
            "outswear\toutswore\toutsworn\tпревосходить в ругани\n" +
            "outswim\toutswam\toutswum\tпревосходить в плавании\n" +
            "outthink\toutthought\toutthought\tпревосходить разумом, перехитрить\n" +
            "outthrow\toutthrew\toutthrown\tвыбрасывать, извергать, бросать лучше\n" +
            "outwear\toutwore\tworn\tизнашивать, служить дольше остальных вещей\n" +
            "outwrite\toutwrote\toutwritten\tписать лучше\n" +
            "overbid\toverbid\toverbid\tперебивать цену, взятку\n" +
            "overbreed\toverbred\toverbred\tразводить, выращивать животных в чрезмерном количестве\n" +
            "overbuild\toverbuilt\toverbuilt\tчрезмерно застраивать, надстраивать\n" +
            "overbuy\toverbought\toverbought\tпокупать слишком много, слишком дорого\n" +
            "overcome\tovercame\tovercome\tпреодолеть, побороть\n" +
            "overdo\toverdid\toverdone\tперестараться, переборщить, утрировать, переутомляться\n" +
            "overdraw\toverdrew\toverdrawn\tпревысить кредит, гиперболизировать\n" +
            "overdrink\toverdrank\toverdrunk\tперепить, слишком много пить\n" +
            "overeat\toverate\tovereaten\tпереесть, есть слишком много\n" +
            "overfeed\toverfed\toverfed\tперекармливать, объедаться\n" +
            "overfly\toverflew\toverflown\tперелетать, пролетать над чем-то\n" +
            "overhang\toverhung\toverhung\tвыступать, нависать, угрожать, вешать драпировку\n" +
            "overhear\toverheard\toverheard\tподслушивать, нечаянно услышать\n" +
            "overlay\toverlaid\toverlaid\tпокрывать, перекрывать, оказывать влияние\n" +
            "overlie\toverlay\toverlain\tлежать, залегать над чем-то, перекрывать \n" +
            "overpay\toverpaid\toverpaid\tпереплачивать, возмещать с избытком\n" +
            "override\toverrode\toverridden\tотменять, перевешивать, преобладать, переехать\n" +
            "overrun\toverran\toverrun\tпереходить пределы, захватывать, заполонять\n" +
            "oversee\toversaw\toverseen\tнаблюдать, надзирать, следить, подсмотреть\n" +
            "oversell\toversold\toversold\tперехваливать, навязывать продукцию, продать больше своих запасов\n" +
            "overset\toverset\toverset\tнарушать порядок, расстраивать, опрокидываться\n" +
            "oversew\toversewed\toversewn / oversewed\tсшивать через край\n" +
            "overshoot\tovershot\tovershot\tпромахнуться, перейти границы, стрелять до изнеможения\n" +
            "oversleep\toverslept\toverslept\tпроспать, заспаться\n" +
            "overspeak\toverspoke\toverspoken\tслишком много разговаривать\n" +
            "overspend\toverspent\toverspent\tсорить деньгами, расстраивать свое здоровье\n" +
            "overspill\toverspilled / overspilt\toverspilled / overspilt\t\n" +
            "проливать, переполнять, перенаселять\n" +
            "\n" +
            "\n" +
            "overtake\tovertook\tovertaken\tдогнать, настигать, овладевать, обогнать\n" +
            "overthink\toverthought\toverthought\tнадумать лишнего, слишком много думать\n" +
            "overthrow\toverthrew\toverthrown\tбросать слишком далеко, свергать, разрушать\n" +
            "overwind\toverwound\toverwound\tперекрутить, крутить слишком сильно, быстро\n" +
            "overwrite\toverwrote\toverwritten\tпереписывать, писать поверх текста, много писать\n" +
            "P\n" +
            "partake\tpartook\tpartaken\tпринимать участие, разделять, отведать, воспользоваться\n" +
            "pay\tpaid\tpaid\tплатить, вознаграждать, отомстить\n" +
            "plead\tpleaded / pled\tpleaded / pled\tзащищать подсудимого, ходатайствовать, простить\n" +
            "prebuild\tprebuilt\tprebuilt\tпредварительно собрать, выстроить\n" +
            "predo\tpredid\tpredone\tсделать заранее, подготовить\n" +
            "premake\tpremade\tpremade\tподготовить, сделать наперед, заранее\n" +
            "prepay\tprepaid\tprepaid\tпредоплачивать, платить наперед\n" +
            "presell\tpresoldpreset\tprespresetold\tрекламировать товар, организовать предпродажу, продавать наперед\n" +
            "preshrink\tpreshrank\tpreshrunk\tобрабатывать ткань для предотвращения ее стяжки\n" +
            "proofread\tproofread\tproofread\tчитать корректуру, корректировать, вычитывать\n" +
            "prove\tproved\tproven / proved\tдоказывать, удостоверять\n" +
            "put\tput\tput\tкласть, положить\n" +
            "Q\n" +
            "quick-freeze\tquick-froze\tquick-frozen\tбыстро замораживать, замерзать\n" +
            "quit\tquit / quitted \tquit / quitted\t\n" +
            "оставлять, покидать, выходить\n" +
            "\n" +
            "\n" +
            "R\n" +
            "read\tread [red]\tread [red]\tчитать\n" +
            "reawake\treawoke\treawaken\tснова пробуждать\n" +
            "rebid\trebid\trebid\tделать повторную ставку\n" +
            "rebind\trebound\trebound\tпереплетать заново (книгу)\n" +
            "rebroadcast\trebroadcast / rebroadcasted\trebroadcast / rebroadcasted\tретранслировать, показывать (передачу) заново\n" +
            "rebuild\trebuilt\trebuilt\tперестраивать\n" +
            "recast\trecast\trecast\tпеределывать, изменять, пересчитывать\n" +
            "recut\trecut\trecut\tвторично нарезать, повторно вырезать (сцены из фильма)\n" +
            "redeal\tredealt\tredealt\tперераздавать карты в игре\n" +
            "redo\tredid\tredone\tпеределывать, делать ремонт\n" +
            "redraw\tredrew\tredrawn\tперерисовывать, обновлять рисунок, выставлять обратный вексель\n" +
            "refit\trefitted / refit\trefitted / refit\t\n" +
            "перекраивать, подгонять заново (по размеру)\n" +
            "\n" +
            "\n" +
            "regrind\treground\treground\tперешлифовывать, перетачивать, притирать\n" +
            "regrow\tregrew\tregrown\tотрастать снова\n" +
            "rehang\trehung\trehung\tперевешивать\n" +
            "rehear\treheard\treheard\tуслышать снова, рассматривать дело повторно\n" +
            "reknit\treknitted / reknit\treknitted / reknit\tвязать заново, соединять заново\n" +
            "relay \trelaid\trelaid\t\n" +
            "класть заново, заменять (черепицу, кафель)\n" +
            "\n" +
            "\n" +
            "relearn\trelearned / relearnt\trelearned / relearnt\t\n" +
            "учиться заново, переучиваться\n" +
            "\n" +
            "\n" +
            "relight\trelit / relighted\trelit / relighted\tзажечь, зажечься снова, загореться\n" +
            "remake\tremade\tremade\tпеределывать, делать заново\n" +
            "rend\trent / rended\trent / rended\t\n" +
            "отрывать, раздирать, дробить, расщеплять\n" +
            "\n" +
            "\n" +
            "repay\trepaid\trepaid\tотдавать, возвращать, возмещать, отплачивать\n" +
            "reread\treread\treread\tперечитывать\n" +
            "rerun\treran\trerun\tперезапускать, повторно проводить, показывать\n" +
            "resell\tresold\tresold\tперепродавать\n" +
            "resend\tresent\tresent\tпереотправлять, посылать заново\n" +
            "reset\treset\treset\tповторно включать, устанавливать, сбрасывать\n" +
            "resew\tresewed\tresewn / resewed\tпришивать заново, перешивать\n" +
            "retake\tretook\tretaken\tснова взять, переснимать, пересдавать (экзамен)\n" +
            "reteach\tretaught\tretaught\tпереучивать, учить заново\n" +
            "retear\tretore\tretorn\tснова разрывать, отрывать\n" +
            "retell\tretold\tretold\tпересказывать, рассказывать снова\n" +
            "rethink\trethought\trethought\tпересматривать, заново осмыслить\n" +
            "retread\tretread\tretread\tсменить покрышку, переобучать, заново давать работу\n" +
            "retrofit\tretrofitted / retrofit\tretrofitted / retrofit\t\n" +
            "модифицировать, подгонять, настраивать\n" +
            "\n" +
            "\n" +
            "rewake\trewoke / rewaked\trewaken / rewaked\tбудить, пробуждаться заново\n" +
            "rewear\trewore\treworn\tносить заново\n" +
            "reweave\trewove / reweaved\trewoven / reweaved\tпереткать, плести, ткать заново, снова соединяться\n" +
            "rewed\trewed / rewedded\trewed / rewedded\tжениться во второй раз\n" +
            "rewet\trewet / rewetted\trewet / rewetted\t\n" +
            "повторно увлажнять, мочить снова\n" +
            "\n" +
            "\n" +
            "rewin\trewon\trewon\tснова победить, победить после проигрыша\n" +
            "rewind\trewound\trewound\tперематывать (назад)\n" +
            "rewrite\trewrote\trewritten\tпереписывать, редактировать, отвечать письменно\n" +
            "rid\trid\trid\tосвобождать, избавлять\n" +
            "ride\trode\tridden\tехать верхом, кататься, ехать (в транспорте)\n" +
            "ring\trang\trung\tзвонить, звенеть\n" +
            "rise\trose\trisen\tподниматься, восходить\n" +
            "roughcast\troughcast\troughcast\tнабрасывать план, намечать, грубо штукатурить\n" +
            "run\tran\trun\tбежать, гнать, управлять, течь\n" +
            "S\n" +
            "sand-cast\tsand-cast\tsand-cast\tотливать металл в песчаную форму\n" +
            "saw\tsawed\tsawed / sawn\tпилить, распилить\n" +
            "say\tsaid\tsaid\tговорить, сказать\n" +
            "see\tsaw\tseen\tвидеть, смотреть\n" +
            "seek\tsought\tsought\tискать, добиваться\n" +
            "sell\tsold\tsold\tпродавать\n" +
            "send\tsent\tsent\tпосылать, отправлять\n" +
            "set\tset\tset\tпомещать, ставить\n" +
            "sew\tsewed\tsewn / sewed\tшить, штопать\n" +
            "shake\tshook\tshaken\tтрясти, встряхивать\n" +
            "shave\tshaved\tshaved / shaven\tбриться\n" +
            "shear\tsheared\tsheared / shorn\tрезать, выстригать, рассекать\n" +
            "shed\tshed\tshed\tпроливать, терять, сбрасывать\n" +
            "shine\tshined / shone\tshined / shone\t\n" +
            "сиять, светить\n" +
            "\n" +
            "\n" +
            "shit\tshit / shat / shitted\tshit/ shat / shitted\tкакать, гадить, срать\n" +
            "shoe\tshod\tshod\tобувать, подковывать, подбивать\n" +
            "shoot\tshot\tshot\tстрелять, охотиться\n" +
            "show\tshowed\tshown / showed\t\n" +
            "показывать, показываться, выставлять напоказ\n" +
            "\n" +
            "\n" +
            "shrink\tshrank / shrunk\tshrunk / shrunken\tуменьшать, уменьшаться, сжиматься, давать усадку\n" +
            "shut\tshut\tshut\tзакрывать\n" +
            "sight-read\tsight-read\tsight-read\tиграть, петь с листа, читать ноты, текст с листа\n" +
            "sing\tsang\tsung\tпеть\n" +
            "sink\tsank / sunk\tsunk\tтонуть, опускаться, погружаться\n" +
            "sit\tsat\tsat\tсидеть, сажать, находиться\n" +
            "slay\tslew / slayed\tslain / slayed\t\n" +
            "убивать, уничтожать\n" +
            "\n" +
            "\n" +
            "sleep\tslept\tslept\tспать\n" +
            "slide\tslid\tslid\tскользить, ползать, кататься\n" +
            "sling\tslung\tslung\tшвырять, вешать через плечо, подвешивать\n" +
            "slink\tslinked / slunk\tslinked / slunk\tкрасться, подкрадываться, рожать преждевременно\n" +
            "slit\tslit\tslit\tразрезать, перерезать\n" +
            "smell\tsmelled / smelt\tsmelled / smelt\t\n" +
            "пахнуть, нюхать\n" +
            "\n" +
            "\n" +
            "smite\tsmote\tsmitten\tпоражать, бить, наказывать\n" +
            "sneak\tsneaked / snuck\tsneaked / snuck\tкрасться, подкрадываться, красть, ускользать\n" +
            "sow\tsowed\tsown / sowed\tсеять, засевать, распространять\n" +
            "speak\tspoke\tspoken\tговорить\n" +
            "speed\tsped / speeded\tsped / speeded\tспешить, ускорять, торопить\n" +
            "spell\tspelled / spelt\tspelled / spelt\t\n" +
            "заколдовать; сменить, дать отдохнуть; писать, произносить слово по буквам\n" +
            "\n" +
            "\n" +
            "spend\tspent\tspent\tтратить, истощать\n" +
            "spill\tspilled / spilt\tspilled / spilt\t\n" +
            "проливать, разливаться\n" +
            "\n" +
            "\n" +
            "spin\tspun\tspun\tпрясть, крутить, вертеть, плести\n" +
            "spit\tspit / spat\tspit / spat\tплевать, пронзать, натыкать, моросить\n" +
            "spoil\tspoiled / spoilt\tspoiled / spoilt\t\n" +
            "портить, баловать\n" +
            "\n" +
            "\n" +
            "spread\tspread\tspread\tраспространяться, расстилать\n" +
            "spring\tsprang / sprung\tsprung\tпрыгать, вскочить\n" +
            "stand\tstood\tstood\tстоять, быть расположенным\n" +
            "stave\tstaved / stove\tstaved / stove\tпроламывать, разбивать\n" +
            "steal\tstole\tstolen\tворовать, красть\n" +
            "stick\tstuck\tstuck\tвтыкать, колоть, приклеивать, липнуть\n" +
            "sting\tstung\tstung\tжалить, причинять боль, обманывать\n" +
            "stink\tstunk / stank\tstunk\tвонять, пахнуть\n" +
            "strew\tstrewed\tstrewn / strewed\tусеять, разбрасывать, посыпать\n" +
            "stride\tstrode\tstridden\tшагать, сидеть верхом\n" +
            "strike\tstruck\tstruck / stricken\tударять, поражать, бастовать\n" +
            "string\tstrung\tstrung\tсвязывать, натягивать, нанизывать\n" +
            "strive\tstrove / strived\tstriven / strived\tстремиться, стараться, пытаться\n" +
            "sublet\tsublet\tsublet\tсдавать в поднаём\n" +
            "sunburn\tsunburned / sunburnt\tsunburned / sunburnt\t\n" +
            "обгорать на солнце\n" +
            "\n" +
            "\n" +
            "swear\tswore\tsworn\tклясться, присягать, ругаться\n" +
            "sweat\tsweat / sweated\tsweat / sweated\tпотеть, сыреть, запотевать\n" +
            "sweep\tswept\tswept\tмести, прочищать, сметать, мчаться\n" +
            "swell\tswelled\tswollen / swelled\tпухнуть, раздуваться, набухать\n" +
            "swim\tswam\tswum\tплавать, плыть\n" +
            "swing\tswung\tswung\tкачать, размахивать\n" +
            "T\n" +
            "take\ttook\ttaken\tбрать, взять\n" +
            "teach\ttaught\ttaught\tобучать, учить\n" +
            "tear\ttore\ttorn\tрвать, сорвать, разорвать\n" +
            "telecast\ttelecast\ttelecast\tпередавать по телевидению\n" +
            "tell\ttold\ttold\tговорить, рассказывать, сообщать\n" +
            "test-drive\ttest-drove\ttest-driven\tделать пробную поездку, тестировать\n" +
            "test-fly\ttest-flew\ttest-flown\tиспытывать самолет в воздухе\n" +
            "think\tthought\tthought\tдумать, полагать\n" +
            "thrive\tthrove / thrived\tthrived / thriven\tпроцветать, преуспевать, буйно расти\n" +
            "throw\tthrew\tthrown\tкидать, бросать\n" +
            "thrust\tthrust\tthrust\tколоть, засовывать, толкать, лезть\n" +
            "tread\ttrod\ttrodden / trod\tидти, ступать, топтать, давить\n" +
            "typecast\ttypecast\ttypecast\tподбирать актеров по типажности\n" +
            "typeset\ttypeset\ttypeset\tнабирать текст для печати, определять тип\n" +
            "typewrite\ttypewrote\ttypewritten\tпечатать на пишущей машинке, набирать текст\n" +
            "U\n" +
            "unbend\tunbent\tunbent\tразгибаться, выпрямляться, смягчаться\n" +
            "unbind\tunbound\tunbound\tразвязать, распуска, ослаблять\n" +
            "unclothe\tunclothed / unclad\tunclothed / unclad\t\n" +
            "раздеваться, раздевать, обнажать\n" +
            "\n" +
            "\n" +
            "underbid\tunderbid\tunderbid\tперебивать цену, назначать более низкую цену\n" +
            "undercut\tundercut\tundercut\tподрезать, сбивать цены, делать подсечку\n" +
            "underfeed\tunderfed\tunderfed\tнедокармливать, недоедать\n" +
            "undergo\tunderwent\tundergone\tиспытывать, переносить\n" +
            "underlie\tunderlay\tunderlain\tподчеркивать, выделять\n" +
            "undersell\tundersold\tundersold\tпродавать дешевле других\n" +
            "underspend\tunderspent\tunderspent\tтратить недостаточно, очень мало\n" +
            "understand\tunderstood\tunderstood\tпонимать, осознавать\n" +
            "undertake\tundertook\tundertaken\tпредпринимать, гарантировать, совершать\n" +
            "underwrite\tunderwrote\tunderwritten\tподписывать, гарантировать, ручаться\n" +
            "undo\tundid\tundone\tрасстегивать, уничтожать, отменять, разбирать\n" +
            "unfreeze\tunfroze\tunfrozen\tразморозить, размораживаться\n" +
            "unhang\tunhung\tunhung\tснимать (висящее)\n" +
            "unhide\tunhid\tunhidden\tпоказывать скрытые элементы\n" +
            "unknit\tunknitted / unknit\tunknitted / unknit\tраспускать (вязанье), распутывать, разъединять\n" +
            "unlearn\tunlearned / unlearnt\tunlearned / unlearnt\t\n" +
            "разучиться, забыть то, что знал\n" +
            "\n" +
            "\n" +
            "unsew\tunsewed\tunsewn / unsewed\tраспарывать сшитое\n" +
            "unsling\tunslung\tunslung\tотвязывать, снимать, осовобождать от ремня\n" +
            "unspin\tunspun\tunspun\tраспускать, расплетать,распутывать\n" +
            "unstick\tunstuck\tunstuck\tотдирать, отклеивать, взлетать (самолет)\n" +
            "unstring\tunstrung\tunstrung\tснимать, ослаблять, распускать, огорчать\n" +
            "unweave\tunwove / unweaved\tunwoven / unweaved\tраспускать, расплетать (ткань)\n" +
            "unwind\tunwound\tunwound\tрасматывать, раскручивать, развивать\n" +
            "uphold\tupheld\tupheld\tподдерживать, помогать, удерживать\n" +
            "upset\tupset\tupset\tопрокидывать, расстраивать, огорчать\n" +
            "W\n" +
            "wake\twoke / waked\twoken / waked\tбудить, просыпаться\n" +
            "waylay\twaylaid\twaylaid\tподстерегать, устраивать засаду\n" +
            "wear\twore\tworn\tносить (одежду)\n" +
            "weave\twove / weaved\twoven / weaved\tткать, плести\n" +
            "wed\twed / wedded\twed / wedded\tвенчать, выдавать замуж, жениться, выходить замуж\n" +
            "weep\twept\twept\tплакать, тосковать, запотевать\n" +
            "wet\twet / wetted\twet / wetted\t\n" +
            "мочить, промочить, мокнуть\n" +
            "\n" +
            "\n" +
            "win\twon\twon\tвыигрывать, побеждать\n" +
            "wind\twound\twound\tчуять, дуть, наматывать, заводить (механизм), извиваться\n" +
            "withdraw\twithdrew\twithdrawn\tбрать назад, отнимать, отзывать, извлекать\n" +
            "withhold\twithheld\twithheld\tвоздерживаться, удерживать, скрывать\n" +
            "withstand\twithstood\twithstood\tустоять, выдерживать, сопротивляться\n" +
            "wring\twrung\twrung\tкрутить, терзать, выжимать, скручивать\n" +
            "write\twrote\twritten\tписать\n" +
            "\n\n\n\n";

    static String modVerbs = "Модальные глаголы (modal verbs) — это особая группа глаголов. Они обозначают возможность, вероятность, необходимость или способность совершить какое-то действие. Есть модальные глаголы, используя которые, вы можете рассказать об умениях человека (can/could), запретить или приказать кому-либо что-то делать (must), дать совет (should) и т. д.\n" +
            "\n" +
            "Рассмотрим несколько примеров модальных глаголов:\n" +
            "\n" +
            "I must finish this article till Wednesday. — Я должен закончить эту статью до среды.\n" +
            "You should follow your doctor’s advice! — Тебе следует слушать советы доктора!\n" +
            "\n" +
            "She can’t swim so she isn’t coming with us to the river. — Она не умеет плавать, поэтому она не идет с нами на реку.\n" +
            "What languages can he speak? — На каких языках он может говорить?\n" +
            "\n" +
            "\n" +
            "\n" +
            "Модальные глаголы в английском языке:\n" +
            "\n" +
            "can — мочь, уметь\n" +
            "could — мог, умел\n" +
            "must — должен, нужно, надо\n" +
            "have to — быть вынужденным, быть должным, приходится, надо\n" +
            "may — стоит, следует\n" +
            "might — должен, следует, стоит\n" +
            "should — мочь, мог бы\n" +
            "ought to — мочь, мог бы\n" +
            "Правила употребления модальных глаголов\n" +
            "Модальный глагол всегда употребляется со смысловым глаголом, который стоит в начальной форме (must do, could see).\n" +
            "I can type very fast. — Я могу печатать очень быстро.\n" +
            "\n" +
            "Модальные глаголы имеют одну форму во всех лицах и числах. Исключением будет лишь have to, который принимает форму has после местоимений he, she, it.\n" +
            "Модальные глаголы всегда стоят в настоящем времени (даже в контексте будущего времени), однако некоторые из них могут принимать прошедшую форму: can — could; may — might, must — had to.\n" +
            "В отрицательных и вопросительных предложениях модальные глаголы не употребляются со вспомогательными, за исключением have to.\n" +
            "I can’t do it. — Я не могу этого сделать.\n" +
            "May I use your laptop? — Могу я воспользоваться вашим ноутбуком.\n" +
            "What do I have to sign? — Что я должен подписать?\n" +
            "\n" +
            "Рассмотрим, как строится утвердительное предложение с модальным глаголом:\n" +
            "\n" +
            "Подлежащее + модальный глагол + смысловой глагол в начальной форме\n" +
            "Обратите внимание, что для соединения модального и смыслового глаголов нам не нужна частица to. За исключением ought to и have to, где to — часть модального глагола.\n" +
            "\n" +
            "We ought to respect our parents. — Мы должны уважать своих родителей.\n" +
            "I have to wear uniform at work. — Я должен носить униформу на работе.\n" +
            "They should study harder if they want to pass the exams. — Им стоит учиться усерднее, если они хотят сдать экзамены.\n" +
            "\n" +
            "\n" +
            "\n" +
            "Отметим, модальный глагол ought to редко употребляется в американском варианте английского и считается формальным в британском английском, поэтому его заменяют на should.\n" +
            "\n" +
            "Mark ought to choose more healthy food. = Mark should choose more healthy food. — Марку следует выбирать более полезные продукты.\n" +
            "\n" +
            "Узнаем, как построить отрицательное предложение с модальным глаголом:\n" +
            "\n" +
            "Подлежащее + модальный глагол + частица not + смысловой глагол в начальной форме\n" +
            "She can’t come tomorrow because she’s having a meeting. — Она не сможет прийти завтра, потому что у нее встреча.\n" +
            "You mustn’t play with matches, it’s dangerous! — Нельзя играть со спичками, это опасно!\n" +
            "\n" +
            "\n" +
            "\n" +
            "Вопросительные предложения с модальным глаголом:\n" +
            "\n" +
            "Модальный глагол + подлежащее + смысловой глагол в начальной форме\n" +
            "Who can help me? — Кто может мне помочь?\n" +
            "Why shouldn’t he come to the party? — Почему ему не следует приходить на вечеринку?\n" +
            "Must I finish this report now? — Я должен закончить этот отчет сейчас?\n" +
            "\n" +
            "\n" +
            "Вопросительные предложения с модальным глаголом have to образуются с помощью вспомогательных глаголов: do/does, did, have, will.\n" +
            "\n" +
            "What did I have to do to stop you? — Что я должен был сделать, чтобы остановить тебя?\n" +
            "Will I have to meet you? — Мне нужно будет тебя встречать?\n" +
            "\n" +
            "Значения модальных глаголов\n" +
            "Давайте разберем значения модальных глаголов и узнаем, чем они отличаются:\n" +
            "\n" +
            "Модальные глаголы can и could\n" +
            "Can — мочь, уметь, иметь возможность/способность что-либо сделать. Can также используется в тех случаях, когда мы спрашиваем разрешения что-то сделать.\n" +
            "\n" +
            "My sister can ride a horse. — Моя сестра умеет ездить на лошади.\n" +
            "I can’t drive, but I can ask my brother to give you a lift. — Я не умею водить, но я могу попросить брата подвезти тебя.\n" +
            "\n" +
            "Can I have your passport, please? — Можно ваш паспорт, пожалуйста?\n" +
            "Can’t you get along with her parents? — Неужели ты не можешь поладить с ее родителями?\n" +
            "\n" +
            "Could — мог. Это прошедшая форма модального глагола can. Еще с помощью could можно вежливо о чем-то попросить.\n" +
            "\n" +
            "Could I have your passport, please? — Вы могли бы показать мне ваш паспорт, пожалуйста?\n" +
            "I could play the piano when I was a little boy. — Я умел играть на пианино, когда я был маленьким мальчиком.\n" +
            "Despite the darkness, I could see many people dancing to pop-music. — Несмотря на темноту, я мог разглядеть много людей, танцующих под поп-музыку.\n" +
            "\n" +
            "\n" +
            "Если вы уверены в том, что событие никак не могло произойти в прошлом, используйте форму can’t have + окончание -ed / 3-я форма глагола.\n" +
            "\n" +
            "He can’t have fallen asleep at the conference. — Не может быть, чтобы он уснул во время конференции.\n" +
            "\n" +
            "\n" +
            "Читайте также\n" +
            "Модальный глагол can в английском языке\n" +
            "Модальные глаголы must и have to\n" +
            "Must — должен, обязан что-либо сделать. Have to — приходится, вынужден что-либо сделать.\n" +
            "\n" +
            "Модальные глаголы must и have to указывают на обязанность и долженствование, но их значения различны. Must предполагает, что никто вас не вынуждал, а вы сами взяли на себя обязательства и несете за них ответственность. Have to подразумевает, что вы должны что-то сделать, так как этого требуют обстоятельства.\n" +
            "\n" +
            "I must work hard to earn enough money for a new car. — Я должен работать усердно, чтобы заработать достаточно денег на машину.\n" +
            "Yesterday I stayed at home, because I had to complete my project. — Вчера я остался дома, потому что должен был завершить проект.\n" +
            "\n" +
            "\n" +
            "\n" +
            "В отрицательном предложении эти модальные глаголы обретают несколько другое значение: mustn’t выражает категоричный запрет, а don’t have to — необязательное выполнение действия (можно делать или не делать).\n" +
            "\n" +
            "You mustn’t go to that night club. — Тебе нельзя идти в тот ночной клуб.\n" +
            "You don’t have to go to the shop. — Тебе можно не идти в магазин.\n" +
            "\n" +
            "\n" +
            "Читайте также\n" +
            "Модальные глаголы have to и must\n" +
            "Модальные глаголы should и ought to\n" +
            "Should — следует. Как правило, используется в советах и рекомендациях, зачастую это мягкий способ указать кому-то, что ему нужно сделать.\n" +
            "\n" +
            "You should sleep more if you want to be healthy. — Тебе следует спать больше, если ты хочешь быть здоровым.\n" +
            "They shouldn’t lie to him — he’ll find out about it anyway. — Им не стоит ему лгать, он все равно узнает об этом.\n" +
            "\n" +
            "\n" +
            "Ought to — следует. Синоним should.\n" +
            "\n" +
            "You ought to visit your grandparents more often. — Тебе следует навещать бабушку и дедушку чаще.\n" +
            "They ought not to shout at their boss. — Им не следует кричать на босса.\n" +
            "\n" +
            "Модальные глаголы may и might\n" +
            "May — может, возможно. В вопросительных предложениях предполагает более вежливую форму вопроса или просьбы.\n" +
            "\n" +
            "May I see a headmaster? — Могу ли я увидеть директора?\n" +
            "I was really worried that you may get hurt. — Я очень волновалась, что ты мог пострадать.\n" +
            "\n" +
            "\n" +
            "Might — синоним may в значении «возможно».\n" +
            "\n" +
            "He might be busy yesterday, that’s why he didn’t call you. — Возможно, он был занят вчера, поэтому не позвонил тебе.\n\n\n\n";

    static String time = "\n" +
            "Past Simple\n" +
            "He worked yesterday.\n" +
            "Он работал вчера.\n" +
            "He didn't work yesterday.\n" +
            "Он не работал вчера.\n" +
            "Did he work yesterday?\n" +
            "Он работал вчера?\n" +
            "Present Simple\n" +
            "He works every day..\n" +
            "Он работает каждый день\n" +
            "He doesn't work every day.\n" +
            "Он не работает каждый день.\n" +
            "Does he work every day?\n" +
            "Он работает каждый день?\n" +
            "Future Simple\n" +
            "He will work tomorrow.\n" +
            "Он будет работать завтра.\n" +
            "He won't work tomorrow.\n" +
            "Он не будет работать завтра.\n" +
            "Will he work tomorrow?\n" +
            "Он будет работать завтра?\n" +
            "Past Continuous\n" +
            "He was working at six o'clock.\n" +
            "Он работал в шесть часов.\n" +
            "He wasn't working at six o'clock.\n" +
            "Он не работал в шесть часов.\n" +
            "Was he working at six o'clock?\n" +
            "Он работал в шесть часов?\n" +
            "Present Continuous\n" +
            "He is working now.\n" +
            "Он работает в данный момент.\n" +
            "He's not working now.\n" +
            "Он не работает сейчас (в данный момент).\n" +
            "Is he working now?\n" +
            "Он сейчас работает?\n" +
            "Future Continuous\n" +
            "He will be working at eight o'clock.\n" +
            "Он будет работать в восемь часов.\n" +
            "He won't be working at eight o'clock.\n" +
            "Он не будет работать в восемь часов.\n" +
            "Will he be working at eight o'clock?\n" +
            "Он будет работать в восемь часов?\n" +
            "Past Perfect\n" +
            "He had finished his report by six o'clock yesterday.\n" +
            "Oн закончил свой отчет к шести вечера вчера.\n" +
            "He hadn't finished his report by six o'clock yesterday.\n" +
            "Oн не закончил свой отчет к шести вечера вчера.\n" +
            "Had he finished his report by six o'clock yesterday?\n" +
            "Oн закончил свой отчет к шести вечера вчера?\n" +
            "Present Perfect\n" +
            "He has finished his report by 3 o'clock today.\n" +
            "Он закончил свой отчет сегодня до трех дня.\n" +
            "He hasn't finished his report by 3 o'clock today.\n" +
            "Он не закончил свой отчет сегодня до трех дня.\n" +
            "Has he finished his report by 3 o'clock today?\n" +
            "Он закончил свой отчет сегодня до трех дня?\n" +
            "Future Perfect\n" +
            "He will have finished his report by 6 o'clock tomorrow.\n" +
            "Он закончит свой отчет завтра к шести.\n" +
            "He won't have finished his report by 6 o'clock tomorrow.\n" +
            "Он не закончит свой отчет завтра к шести.\n" +
            "Will he have finished his report by 6 o'clock tomorrow?\n" +
            "Он закончит свой отчет завтра к шести?\n" +
            "Past Perfect Continuous\n" +
            "He had been working for an hour when I came.\n" +
            "Oн работал уже в течение часа к тому моменту, как я пришел.\n" +
            "He hadn't been working for an hour when I came.\n" +
            "Он не поработал (целый) час, когда я пришел.\n" +
            "Had he been working for an hour when I came?\n" +
            "Он уже поработал (целый) час, когда я пришел?\n" +
            "Present Perfect Continuous\n" +
            "He has been working for an hour (аlready).\n" +
            "Он работает уже в течение часа.\n" +
            "He hasn't been working for an hour.\n" +
            "Он не работал в течение часа.\n" +
            "Has he been working for an hour?\n" +
            "Он работает уже в течение часа?\n" +
            "Future Perfect Continuous\n" +
            "He will have been working in this office for two years by March.\n" +
            "Oн проработает два года в этом офисе к марту.\n" +
            "He won't have been working in this office for two years by March.\n" +
            "Oн не проработает два года в этом офисе к марту.\n" +
            "Will he have been working in this office for two years by March?\n" +
            "Проработает ли он два года в этом офисе к марту?\n\n\n\n";

    static String passiveVoice = "В английском языке существует два залога: активный (действительный) залог и пассивный (страдательный) залог.\n" +
            "\n" +
            "Активный залог (Active Voice) - это грамматическая конструкция, которая показывает, что действие в предложении выполняется подлежащим.\n" +
            "\n" +
            "His parents love him. – Его любят родители.\n" +
            "I did my homework yesterday. – Я сделал свое домашнее задание вчера.\n" +
            "Пассивный залог (Passive Voice) – это грамматическая конструкция, которая показывает, что подлежащее (кто? что?) не совершает действие самостоятельно, а испытывает действие на себе, является объектом действия. Тот (то), над кем (чем) совершается действие, называется passive subject.\n" +
            "\n" +
            "He is loved by his parents. – Он любим родителями.\n" +
            "My homework was done by me yesterday. – Мое домашнее задание было выполнено мной вчера.\n" +
            "Формы пассивного залога\n" +
            "Пассивный залог образуется с помощью вспомогательного глагола to be и формы Past Participle (смыслового глагола в третьей форме). Только переходные глаголы могут образовывать формы пассивного залога.\n" +
            "\n" +
            "Пассивный залог используется в нескольки временах, и для каждого из времен вспомогательный to be имеет свою особую форму. Пассивный залог не используется во временах группы Perfect Continuous и во времени Future Continuous.\n" +
            "\n" +
            "УТВЕРЖЕНИЕ\n" +
            "ОТРИЦАНИЕ\n" +
            "ВОПРОС\n" +
            "Tense\tActive\tPassive\n" +
            "Present\n" +
            "Simple\tTom brings the package.\n" +
            "Том приносит посылку.\tThe package is brought.\n" +
            "Посылку приносят.\n" +
            "Past\n" +
            "Simple\tTom brought the package a day ago.\n" +
            "Том принес посылку день назад.\tThe package was brought two days ago.\n" +
            "Посылку принесли два дня назад.\n" +
            "Future\n" +
            "Simple\tTom will bring the package.\n" +
            "Том принесет посылку.\tThe package will be brought.\n" +
            "Посылку принесут.\n" +
            "Present\n" +
            "Continuous\tTom is writing a letter now.\n" +
            "Том пишет письмо сейчас.\tThe letter is being written right now.\n" +
            "Письмо пишут прямо сейчас.\n" +
            "Past\n" +
            "Continuous\tTom was writing a letter at 5 p.m. yesterday.\n" +
            "Том писал письмо вчера в пять часов вечера.\tThe letter was being written at 5 p.m. yesterday.\n" +
            "Письмо писали вчера в пять часов вечера.\n" +
            "Future\n" +
            "Continuous\tTom will be writing a letter tomorrow at 5 p.m.\n" +
            "Том будет писать письмо завтра в пять.\t---\n" +
            "нет\n" +
            "Present\n" +
            "Perfect\tTom has already brought the package.\n" +
            "Том уже принес посылку.\tThe package has already been brought.\n" +
            "Посылку уже принесли.\n" +
            "Past\n" +
            "Perfect\tTom had brought the package before you came.\n" +
            "Том принес посылку до того, как ты пришел.\tThe package had been brought before you came.\n" +
            "Посылку принесли перед тем, как ты пришел.\n" +
            "Future\n" +
            "Perfect\tTom will have brought the package by 10 o'clock tomorrow.\n" +
            "Том принесет посылку к 10 утра завтра.\tThe package will have been brought by 10 o’clock tomorrow.\n" +
            "Посылку принесут завтра к 10 утра.\n" +
            "Present Perfect Continuous\tTom has been driving the car for 6 hours.\n" +
            "Tом вел машину на протяжении 6 часов.\t---\n" +
            "нет\n" +
            "Past Perfect Continuous\tI said that Tom had been driving a car for 6 hours.\n" +
            "Я сказал, что Том вел машину на протяжении 6 часов.\t---\n" +
            "нет\n" +
            "Future Perfect Continuous\tI will have been living here for 1 year next month.\n" +
            "В следующем месяце будет год, как я тут живу.\t---\n" +
            "нет\n" +
            "Future-in-the-Past\tJack said that Tom would bring the package.\n" +
            "Джек сказал, что Том принесет посылку.\tJack said that the package would be brought.\n" +
            "Джек сказал, что посылку принесут.\n" +
            "To be going to\tTom is going to bring the package.\n" +
            "Том планирует принести посылку.\tThe package is going to be brought.\n" +
            "Посылку планируют принести.\n" +
            "Used to\tTom used to bring the package.\n" +
            "Том (обычно) приносил посылку.\tThe package used to be brought by Tom.\n" +
            "Обычно посылка приносилась Томом.\n" +
            "Утверждение\n" +
            "Для образования пассивного залога в утвердительном предложении нужен объект, над которым совершается действие, вспомогательный глагол to be в соответствующем времени и третья форма смыслового глагола (Past Participle).\n" +
            "\n" +
            "My lunch is eaten by my dog. – Мой обед съеден моей собакой.\n" +
            "This mission was successfully completed. – Эта миссия была успешно выполнена.\n" +
            "The parcel will be delivered tomorrow morning. – Посылка будет доставлена завтра утром.\n" +
            "Отрицание\n" +
            "Для отрицательного предложения с пассивным залогом необходимо после вспомогательного глагола в нужной временной и личной форме поставить отрицательную частицу not.\n" +
            "\n" +
            "This article is not written by Jane. – Эта статья не написана Джейн.\n" +
            "I was not informed about this concert. – Меня не проинформировали об этом концерте.\n" +
            "My project won’t have been finished till Monday. – Мой проект не будет завершен к понедельнику.\n" +
            "Вопрос\n" +
            "Для того, чтобы создать общий вопрос в пассивном залоге, необходимо вспомогательный глагол в нужной временной и личной форме вынести перед Passive Subject (пассивным подлежащим).\n" +
            "\n" +
            "Are you punished? – Ты наказан?\n" +
            "Has the job been already done? –Работа уже выполнена?\n" +
            "Will the parcel be delivered soon? – Скоро будет доставлена посылка?\n" +
            "Специальный вопрос в пассивном залоге образуется с помощью добавления вопросительного слова или фразы, которая ставится в самом начале предложения. Дальнейший порядок слов такой же, как в общем вопросе для пассивного залога.\n" +
            "\n" +
            "When will the package be brought? – Когда принесут посылку?\n" +
            "How often was the package brought? – Как часто приносили посылку?\n" +
            "Until when will the package have been brought? – К какому моменту принесут посылку?\n" +
            "Употребление Passive Voice\n" +
            "Отсутствие исполнителя\n" +
            "Passive Voice используется, если исполнитель действия не важен, не известен или очевиден из контекста.\n" +
            "\n" +
            "I was robbed three weeks ago. – Меня ограбили три недели назад. (Мы не знаем, кем был грабитель.)\n" +
            "The tea is grown in India. – Чай выращивают в Индии. (Нам не важно, кто совершает действие.)\n" +
            "My meal has just been prepared at the restaurant. – Мою еду только что приготовили в ресторане. (Очевидно, что действие совершил повар.)\n" +
            "Если нужно указать на того, кто выполняет действие, то это лицо используется с предлогом by.\n" +
            "\n" +
            "I am punished by my teacher. – Я наказан своим учителем.\n" +
            "The window was broken by Jack. – Окно было разбито Джеком.\n" +
            "The article will be written by us. – Статья будет написана нами.\n" +
            "Если вместо нас действие выполняет кто-то другой (чаще всего профессионал и за определенную плату), то используется конструкция have something done.\n" +
            "\n" +
            "Действие важнее исполнителя\n" +
            "В пассивном залоге выражаются те действия, которые сами по себе важнее, чем их исполнитель. Например, описание событий в деловых письмах, статьях, новостных заголовках, инструкциях, рекламе.\n" +
            "\n" +
            "80-year-old man was robbed near his apartment door yesterday. – Вчера восьмидесятилетнего мужчину ограбили прямо у двери его квартиры. (Новостной заголовок.)\n" +
            "A new school will have been opened by the beginning of this school year. – Новая школа откроется к началу этого учебного года. (Нам не важно, кто исполнитель.)\n" +
            "The milk is put to the specific container where it’s boiled at 100 degrees Centigrade. – Молоко помещают в специальную емкость, где оно кипятится при 100 градусах по Цельсию. (Описание технологического процесса.)\n" +
            "Неблагоприятные события\n" +
            "Пассивный залог используется для описания неблагоприятных событий, чтобы не упоминать виноватых в произошедшем.\n" +
            "\n" +
            "The window was broken. – Окно разбилось.\n" +
            "The article has been written awfully. – Статья написана ужасно.\n" +
            "She is not mentioned at this list. – Её нет в этом списке.\n" +
            "Безличностные конструкции\n" +
            "В пассивном залоге используются безличностные конструкции – обороты, где не упоминается, кем или чем выполняется действие. Чаще всего они используются с такими глаголами как: think (думать), believe (верить), say (говорить), report (сообщать), know (знать), expect (ожидать), consider (рассматривать), understand (понимать).\n" +
            "\n" +
            "My friends believe that John crashed the car. – Мои друзья верят, что Джон разбил машину.\n" +
            "It’s believed that John crashed the car. – Принято верить, что Джон разбил машину.\n" +
            "John is believed to have crashed the car. – Все думают, что Джон разбил машину.\n" +
            "My mother expects that I will pass the exam. – Моя мама ожидает, что я сдам экзамены.\n" +
            "It is expected that I will pass the exam. – Ожидается, что я сдам экзамен.\n" +
            "I am expected to pass the exam. – От меня ожидают сдачи экзаменов.\n" +
            "Пассивный залог часто используется с глаголами, которые требуют после себя предлогов: to speak to (говорить с), to talk to, of, about (разговаривать с, о), to look at, after (смотреть на, за), to laugh at (смеяться с), to send for (посылать за), to listen to (слушать), to rely (up) on (полагаться, доверять). В таких предложениях предлог ставится после глагола, а не перед существительным.\n" +
            "\n" +
            "The professor is listened to attentively. – Профессора слушают внимательно.\n" +
            "This journal is being talked about now. – Об этом журнале сейчас говорят.\n" +
            "Matt was laughed at when he was small. – Над Мэттом смеялись, когда он был маленьким.\n\n\n\n";

    static String conditionals = "Conditionals (условные конструкции или условные предложения) – особый вид сложноподчиненных предложений, когда в придаточном предложении выражается определенное условие, а в главном – последствие этого условия. Такие предложения часто называются if-sentences (предложения с союзом if).\n" +
            "\n" +
            "В зависимости от условия, выраженного в предложении, условные конструкции делятся на четыре типа: условные предложения нулевого типа, первого, второго и конструкции третьего типа. Выделяют также смешанный тип условных предложений.\n" +
            "\n" +
            "Условные конструкции нулевого типа\n" +
            "Zero Conditional (условное предложение нулевого типа) – условное предложение, которое выражает общие истины, природные и научные факты, правила или часто повторяемые события, которые стали правилом. В таких предложениях подчинительный союз if (если) может быть заменен на when (когда).\n" +
            "\n" +
            "В условных предложениях нулевого типа всегда используется время Present Simple как в главном, так и в придаточном предложениях.\n" +
            "\n" +
            "Ice cream melts if we heat it. – Мороженое тает, если мы его нагреем.\n" +
            "If you don’t water plants, they die. – Если ты не будешь поливать растения, они умрут.\n" +
            "The ground gets wet when it rains. – Земля намокает, когда идет дождь.\n" +
            "When we mix blue and yellow, we get green. – Когда мы смешиваем синий и желтый, у нас получается зеленый.\n" +
            "Условные конструкции 1-го типа\n" +
            "First Conditional (условное предложение 1-го типа) – условное предложение, которое выражает реальную или очень вероятную ситуацию в настоящем или будущем.\n" +
            "\n" +
            "В условных предложениях этого типа в придаточной части всегда используется время Present Simple, а в главной части, в зависимости от ситуации, может использоваться Future Simple, повелительное наклонение или модальные глаголы can, must, may и др. с инфинитивом без частицы to.\n" +
            "\n" +
            "Future Simple\n" +
            "If I like this dress, I’ll definitely buy it. – Если мне понравится это платье, я его обязательно куплю.\n" +
            "Your feet will hurt if you wear these uncomfortable shoes. – У тебя будут болеть ноги, если ты будешь носить эти неудобные туфли.\n" +
            "If Jack decides to move to Florida, we will never see him again. – Если Джек решит переехать во Флориду, мы его больше никогда не увидим.\n" +
            "Повелительное наклонение\n" +
            "If you see Jessica tonight, give her this book, please. – Если ты увидишь Джессику сегодня вечером, дай ей эту книгу, пожалуйста.\n" +
            "If oranges are not expensive, buy me two kilos of them. – Если апельсины будут не дорогими, купи мне их два килограмма.\n" +
            "Please, come to my place and help me if you are not busy tomorrow. – Пожалуйста, приди ко мне домой и помоги мне, если ты не занят завтра.\n" +
            "Модальные глаголы\n" +
            "If you like this shoes, we can buy them. – Если тебе нравятся эти туфли, мы можем их купить.\n" +
            "You may stay at home next Monday if there is no work to do here. – Вы можете остаться дома в следующий понедельник, если тут не будет никакой работы.\n" +
            "Kate must get up really early if she gets this job in New York. It’s too far. – Кейт придется вставать очень рано, если она получит эту работу в Нью Йорке. Она находится слишком далеко.\n" +
            "В условных предложениях 1-го типа в придаточной части с отрицательным оттенком вместо союза if можно использовать unless (если не) и глагол в утвердительной форме.\n" +
            "\n" +
            "You don’t have to do this unless you want. – Тебе не обязательно делать этого, если тебе не хочется.\n" +
            "I will be very angry unless you clean your room. – Я буду очень злая, если вы не уберетесь в своей комнате.\n" +
            "Matt won’t be able to go on holidays with us unless he saves some money. – У Мэтта не получится поехать с нами на отдых, если он не накопит немного денег.\n" +
            "Условные конструкции 2-го типа\n" +
            "Second Conditional (условное предложение 2-го типа) – условное предложение, выражающее нереальную ситуацию в настоящем. Придаточное предложение выражает воображаемую ситуацию, которая противоречит фактам в настоящем, а поэтому невозможна или маловероятна в настоящем или будущем.\n" +
            "\n" +
            "В условных предложениях 2-го типа в придаточной части всегда используется Past Simple, причем глагол were (а не was) используется для всех лиц. В главной части таких предложений используются модальные глаголы would, could, might с инфинитивом глагола без частицы to. В этих предложениях нельзя заменять союз if на when.\n" +
            "\n" +
            "If I were him, I would never do that. – Если бы я был на его месте, я бы никогда так не делал.\n" +
            "Jack could be happy if he married Janice. – Джек был бы счастлив, если бы женился на Дженис.\n" +
            "If Martha were rich, would she move to another country? – Если бы Марта была богата, она бы переехала в другую страну?\n" +
            "The children might play outside if the weather were nice. – Дети могли бы поиграть на улице, если бы погода была хорошая.\n" +
            "Условные конструкции 3-го типа\n" +
            "Third Conditional (условные предложения 3-го типа) – условное предложение, которое выражает нереальную ситуацию в прошлом и ее нереальные последствия, то есть эта ситуация так и не произошла. Чаще всего условные конструкции 3-го типа передают досаду, критику, упрек в чем-то несделанном в прошлом.\n" +
            "\n" +
            "В условных предложениях 3-го типа в придаточной if-части используется время Past Perfect, а также иногда Past Perfect Continuous, а в главной части – модальные глаголы would, could, might и совершенный инфинитив без частицы to. В таких предложениях союз if не может быть заменен на when.\n" +
            "\n" +
            "You could have passed your exam if you had studied harder. – Ты бы сдал свой экзамен, если бы учился усерднее.\n" +
            "If they had asked me for help, I would have helped them. – Если бы они меня попросили о помощи, я бы им помог.\n" +
            "What would you have done if I hadn’t helped you at that time? – Что бы ты делал, если бы я тебе тогда не помог?\n" +
            "If you hadn’t been talking on the phone for so long, we might have arrived to the airport on time. – Если бы ты не говорила по телефону так долго, мы бы приехали в аэропорт во время.\n" +
            "Смешанные условные конструкции\n" +
            "Mixed Conditionals (условные предложения смешанного типа) – условные предложения, в которых ситуации или действия в придаточной и главной частях относятся к разным временам. Между собой смешиваться могут только условные предложения 2-го и 3-го типов. Существует два типа смешанных условных предложений.\n" +
            "\n" +
            "В первом типе смешанных предложений условие в придаточной if-части относится к прошедшему времени, а результат в главном предложении – к настоящему. В этом случае в придаточном if-предложении используется время Past Perfect (как в third conditional), а в главном – модальные глаголы would, could, might с простым инфинитивом без частицы to (как в second conditional).\n" +
            "\n" +
            "If I had got that job, I could be rich now. – Если бы я получил ту работу, я бы был сейчас богатым.\n" +
            "If we had taken a map, we wouldn’t be lost now. – Если бы мы взяли карту, мы бы сейчас не потерялись.\n" +
            "They might be still together if they hadn’t moved to different countries. – Они бы до сих пор были вместе, если бы не разъехались по разным странам. \n" +
            "Matt would feel better today if he hadn’t gone to the party yesterday. – Мэтт чувствовал бы себя лучше сегодня, если бы не пошел на вчерашнюю вечеринку.\n" +
            "Во втором типе смешанных предложений условие в придаточной if-части не относится к определенному времени, а является общей постоянной характеристикой чего-то. Однако, результат или последствия этого в главном предложении произошли в прошедшем. В этом случае в придаточном if-предложении используется время Past Simple (как в second conditional), а в главном – модальные глаголы would, could, might с совершенным инфинитивом без частицы to (как в third conditional).\n" +
            "\n" +
            "I wouldn’t have helped you if we weren’t friends. – Я бы тебе не помогла, если бы мы не были друзьями.\n" +
            "If I spoke French, I could have been appointed to that position. – Если бы я говорил по-французски, меня бы назначили на ту должность.\n" +
            "If I weren’t afraid of cats, I might have adopted one long time ago. – Если бы я не боялся котов, я бы уже давно взял себе одного.\n" +
            "Kate wouldn’t have let you stay overnight at her place if she weren’t a kind person. – Кейт не разрешила бы тебе переночевать у нее, если бы она не была доброй.\n" +
            "Запятая в условных предложениях\n" +
            "В условных предложениях, если придаточное if-предложение следует за главной частью, то запятая между ними не ставится.\n" +
            "\n" +
            "I will buy this balloon for you if you behave well. – Я куплю тебе этот шарик, если ты будешь хорошо себя вести.\n" +
            "Matt wouldn’t have done this mistake if you had explained something to him. – Мэтт не сделал бы этой ошибки, если бы ты ему что-нибудь объяснил.\n" +
            "Если придаточная часть стоит перед главной, то они отделяются запятой.\n" +
            "\n" +
            "If you hold an ice cube in your hand, it melts. – Если подержать кубик льда в руке, он растает.\n" +
            "If I were you, I wouldn’t have given such a big sum of money to Paul. – Будь я на твоем месте, я бы не давал Полу такую большую сумму денег.\n\n\n\n";

    static String numerals = "Числительные – это самостоятельная часть речи, которая указывает на количество предметов или их порядок. Английские числительные также называются количественными прилагательными. и в предложении могут выступать в качестве определения или же именной частью сложного сказуемого. Числительные английского языка подразделяются на количественные и порядковые числительные.\n" +
            "\n" +
            "Количественные числительные\n" +
            "Количественные числительные (cardinal numbers) указывают на количество объектов. Отвечают на вопрос «сколько?».\n" +
            "\n" +
            "1 – one\n" +
            "2 – two\n" +
            "3 – three\n" +
            "4 – four\n" +
            "5 – five\n" +
            "6 – six\n" +
            "7 – seven\n" +
            "8 – eight\n" +
            "9 – nine\n" +
            "10 – ten\n" +
            "11 – eleven\n" +
            "12 – twelve\n" +
            "13 – thirteen\n" +
            "14 – fourteen\n" +
            "15 – fifteen\n" +
            "16 – sixteen\n" +
            "17 – seventeen\n" +
            "18 – eighteen\n" +
            "19 – nineteen\n" +
            "20 – twenty\n" +
            "21 – twenty-one\n" +
            "22 – twenty-two\n" +
            "23 – twenty-three\n" +
            "24 – twenty-four\n" +
            "25 – twenty-five\n" +
            "26 – twenty-six\n" +
            "27 – twenty-seven\n" +
            "28 – twenty-eight\n" +
            "29 – twenty-nine\n" +
            "30 – thirty\n" +
            "40 – forty\n" +
            "50 – fifty\n" +
            "60 – sixty\n" +
            "70 – seventy\n" +
            "80 – eighty\n" +
            "90 – ninety\n" +
            "100 – one hundred\n" +
            "200 – two hundred\n" +
            "1000 – one thousand\n" +
            "1200 – one thousand two hundred / twelve hundred\n" +
            "100 000 – one hundred thousand\n" +
            "1 000 000 – one million\n" +
            "1 000 000 000 – one billion (миллиард)\n" +
            "При счете используя сотни, тысячи, миллионы и т.д. к числительным не прибавляется окончание -s, указывающее на множественное число. Окончание -s используется, когда числительные выступают в качестве существительных (кто? что?), то есть в сочетаниях dozens of (дюжины, много), hundreds of (сотни), thousands of (тысячи) в значении «очень много».\n" +
            "\n" +
            "I bought twelve eggs. I hope it will be enough. – Я купила двенадцать яиц. Надеюсь, этого будет достаточно.\n" +
            "There were dozens of students from our university at this party. – На этой вечеринке были десятки студентов с нашего универа.\n" +
            "Two hundred dollars for this shirt is too expensive. – Двести долларов за эту рубашку – это слишком дорого.\n" +
            "Hundreds of people protested against new economic reforms. – Сотни людей протестовали против новых экономических реформ.\n" +
            "Количественные числительные используются в номерах страниц, глав, томов, аудиторий, домов, автобусов и т.д. В этом случае данные существительные используются без артикля, а числительные ставятся после существительных, к которым относятся.\n" +
            "\n" +
            "We stopped reading at page fifty-five (55). – Мы остановились читать на пятьдесят пятой странице.\n" +
            "The next lecture will be in room four five four (454). – Следующая лекция будет в четыреста пятьдесят четвертой комнате.\n" +
            "Порядковые числительные\n" +
            "Порядковые числительные (ordinal numerals) указывают на порядок объектов, их порядковый номер. Они отвечают на вопрос «который по счету?». Большинство порядковых числительных образуется с помощью окончания -th.\n" +
            "\n" +
            "1 – first\n" +
            "2 – second\n" +
            "3 – third\n" +
            "4 – fourth\n" +
            "5 – fifth\n" +
            "6 – sixth\n" +
            "7 – seventh\n" +
            "8 – eighth\n" +
            "9 – ninth\n" +
            "10 – tenth\n" +
            "11 – eleventh\n" +
            "12 – twelfth\n" +
            "13 – thirteenth\n" +
            "14 – fourteenth\n" +
            "15 – fifteenth\n" +
            "16 – sixteenth\n" +
            "17 – seventeenth\n" +
            "18 – eighteenth\n" +
            "19 – nineteenth\n" +
            "20 – twentieth\n" +
            "21 – twenty-first\n" +
            "22 – twenty-second\n" +
            "23 – twenty-third\n" +
            "24 – twenty-fourth\n" +
            "25 – twenty-fifth\n" +
            "26 – twenty-sixth\n" +
            "27 – twenty-seventh\n" +
            "28 – twenty-eighth\n" +
            "29 – twenty-ninth\n" +
            "30 – thirtieth\n" +
            "40 – fortieth\n" +
            "50 – fiftieth\n" +
            "60 – sixtieth\n" +
            "70 – seventieth\n" +
            "80 – eightieth\n" +
            "90 – ninetieth\n" +
            "100 – hundredth\n" +
            "200 – two hundredth\n" +
            "1000 – thousandth\n" +
            "1200 – one thousand two hundredth\n" +
            "100 000 – hundred thousandth\n" +
            "1 000 000 – millionth\n" +
            "1 000 000 000 – billionth (миллиардный)\n" +
            "Существительные, перед которыми стоят порядковые числительные, используются с определенным артиклем the. Они отвечают на вопрос «который по счету?».\n" +
            "\n" +
            "It is the first time I see such beautiful flowers. – В первый раз я вижу такие красивые цветы!\n" +
            "The tenth candy was too much for me. – Десятая конфета была для меня лишней.\n" +
            "Matt was the hundredth customer that day so he got a present. – В тот день Мэтт был сотым покупателем, поэтому он получил подарок.\n" +
            "Особенности числительных\n" +
            "Ноль\n" +
            "Цифра ноль в английском языке в зависимости от контекста может читаться по-разному: zero, o, nil.\n" +
            "\n" +
            "Ноль произносится как «zero», когда ноль используется в дробях, процентах, телефонных номерах и в определенных выражениях.\n" +
            "\n" +
            "Please, write down my phone number: three-two-four zero-zero-one six-eight-six. – Пожалуйста, запишите мой телефон: 3-2-4 0-0-1 6-8-6.\n" +
            "There is 0% chance that we will win. – У нас нулевые шансы того, что мы выиграем.\n" +
            "O (читается, как английская буква o [əu]) – используется в обозначении годов, времени, в адресах, иногда в телефонных номерах.\n" +
            "\n" +
            "It happened in fourteen o seven. – Это произошло в 1407 году.\n" +
            "Our train leaves at thirteen o five. – Наш поезд отправляется в 13:05.\n" +
            "Nil – используется в счете спортивных матчей.\n" +
            "\n" +
            "Our team won with the score three-nil. – Наша команда выиграла со счетом 3-0.\n" +
            "And the game is ending in a draw with a score nil-nil. Such a tough game it was! – И игра заканчивается ничьей со счетом ноль-ноль. Какая была напряженная игра!\n" +
            "Иногда в британском варианте английского языка встречается слово naught или nought в значении «ноль», «нуль», «ничто». Сейчас его использование в качестве цифры считается устаревшим и само слово чаще всего используется в фразеологизмах. \n" +
            "\n" +
            "All Kate's plans came to naught.– Все планы Кейт свелись к нулю.\n" +
            "That guy is naught but a worthless fool.– Тот парень просто никчемный дурак.\n" +
            "Летоисчисление\n" +
            "Годы в английском языке обозначаются количественными числительными. Четырехзначные годы при чтении делятся пополам и эти половинки читаются как два отдельных числа. Однако, миллениумы (тысячелетия, например, 2000 г.) читаются тысячами. Годы, состоящие из трех чисел, могут также делиться и читаться как однозначное и двузначное числа, или же они могут читаться как обычное трехзначное число. Годы нынешнего столетия могут читаться как обычные четырехзначные числа.\n" +
            "\n" +
            "BC – Before Christ – до Рождества Христова, до нашей эры.\n" +
            "AD – Anno Domini – после Рождества Христова, наша эра.\n" +
            "\n" +
            "2000 BC – two thousand BC\n" +
            "1825 – eighteen twenty-five\n" +
            "1660 BC – sixteen sixty BC\n" +
            "1901 – nineteen o one\n" +
            "33 AD – thirty-three AD\n" +
            "2000 – two thousand\n" +
            "1003 – ten o three\n" +
            "2016 – twenty sixteen, two thousand sixteen\n" +
            "Дроби\n" +
            "Простые дроби (fractions) в английском языке часто пишутся словами и через дефис, если в числителе или знаменателе не используется свой дефис. Для числителя (numerator) используются количественные числительные, а для знаменателя (denominator) – порядковые.\n" +
            "\n" +
            "1/2 – one-half, a half (0.5)\n" +
            "1/100 – one-hundredth (0.01)\n" +
            "1/5 – one-fifth\n" +
            "1/1000 – one-thousandth\n" +
            "2/7 – two-seventh\n" +
            "44/73 – forty-four seventy-third\n" +
            "27/100 – twenty-seven hundredth\n" +
            "6 целых 15/19 – six and fifteen-nineteenth\n" +
            "Десятичные дроби (decimals) в английском языке читаются с помощью слова point (точка), после которой все цифры читаются отдельно. Это правило не относится к счету денег.\n" +
            "\n" +
            "0.2 – zero point two (point two)\n" +
            "1.05 – one point zero five\n" +
            "0.25 – zero point two five (point two five)\n" +
            "3.005 – three point zero zero five\n" +
            "120.85 – one hundred twenty point eight five\n" +
            "13.445 – thirteen point four four five\n" +
            "Проценты\n" +
            "Проценты (percentages) в английском языке обозначаются словом percent (процент). После числительных слово percent никогда не принимает окончание множественного числа -s, так как с французского языка это слово дословно переводится как «из сотни», «на сотню».\n" +
            "\n" +
            "1% – one percent\n" +
            "10% – ten percent\n" +
            "255% – two hundred fifty-five percent\n" +
            "30.55% – thirty point five five percent\n" +
            "Деньги\n" +
            "Для счета денег в английском языке сначала произносится число, а потом название валюты. Если число состоит из десятичной дроби, то произносится целая часть, название валюты, после которой десятичная часть (копейки) произносится как обычное число. В конце может добавляться название монеты, если оно существует.\n" +
            "\n" +
            "$2 – two dollars\n" +
            "€14,99 – fourteen euros ninety nine (cents, euro cents)\n" +
            "£204 – two hundred and four pounds\n" +
            "₴167 – one hundred and sixty seven hryvnias\n" +
            "₱25.15 – twenty five roubles and fifteen kopecks\n" +
            "¥10 000 – ten thousand yen\n" +
            "Арифметические действия\n" +
            "При арифметических действиях глагол to be или to equal (равняться) в большинстве случаев употребляется в форме единственного числа.\n" +
            "\n" +
            "2 + 1 = 3 – two plus one is three.\n" +
            "5 – 4 = 1 – five minus four equals one.\n" +
            "20 х 2 = 40 – twenty multiplied by two is forty.\n" +
            "30 : 6 = 5 – thirty divided by six equals five.\n" +
            "В случае сложения глагол может стоять также в форме множественного числа. Также может использоваться глагол to make.\n" +
            "\n" +
            "3 + 21 = 24 – three and twenty-one are twenty-four.\n" +
            "5 + 100 = 105 – five plus hundred equal one hundred five.\n" +
            "7 + 3 = 10 – seven and three make ten.\n\n\n\n";
}
